[
{"malehw":"Ht: 9-11.5, Wt: 7-9","femalehw":"Ht: 9-11.5, Wt: 7-9","catfriendly":"••••","easytraining":"•••","watchdog":"••••••","grooming":"•••••","coldtolerant":"•••","temperament":"The affenpinscher lives up to his name,\"monkey terrier\", in both looks and actions. A terrier at heart, he is busy, inquisitive, bold and stubborn, but he also loves to monkey around, being playful and mischievous. He tends to bark and even climb. He is fairly good with other dogs and pets. This little dog is best with a family that likes entertainment and has a very good sense of humor.","care":"Although an energetic and active dog, the exercise needs of the affenpinscher can be met with vigorous indoor games or romps in the yard, or with short walks on leash. He enjoys playing outside, but cannot live outdoors. His harsh coat needs combing two or three times weekly, plus shaping every three months. Shaping for pets is by clipping or stripping.","breed":"Affenpinscher","health":"Major concerns: none\nMinor concerns: patellar luxation, Legg - Perthes\nOccasionally seen: PDA, open fontanel \nSuggested tests: knee, (cardiac)\nLife span: 12-14 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":1,"url":"https://www.petfinder.com/dog-breeds/Affenpinscher"}
{"malehw":"Ht: 27, Wt: 60","femalehw":"Ht: 25, Wt: 50","catfriendly":"••••","easytraining":"•••","watchdog":"•••••","grooming":"•••••","coldtolerant":"••••","care":"Despite his glamorous reputation, the Afghan hound is a hunter at heart, bred to chase down game over rugged terrain. While he maintains his regal bearings inside, he needs a daily chance to stretch his legs in a safe area. His worst trait is a reluctance to come when called. He will chase small animals outside; inside, he will coexist peacefully. The Afghan Hound is gentle with children and described by some as 'catlike'. He is independent yet sensitive and not overly demonstrative. He can be reserved with strangers; some can be timid. He has a gay, clownish side.","breed":"Afghan Hound","health":"The Afghan needs daily exertion, either in the form of a long walk followed by a short sprint, or preferably, a chance to run full speed in a safe, enclosed area. Although his coat might make him amenable to outdoor living in temperate areas, he needs a soft bed and is better suited as a house dog. The coat requires some commitment, especially when shedding the puppy coat; most adult coats need brushing or combing every two to three days.","energy":"•••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••","index":2,"url":"https://www.petfinder.com/dog-breeds/Afghan-Hound"}
{"malehw":"Ht: 23, Wt: 45","femalehw":"Ht: <23, Wt: 45","catfriendly":"•••","easytraining":"••••","watchdog":"•••••","grooming":"•••••","coldtolerant":"••••","care":"Among the most versatile of terriers, the Airedale is bold, playful and adventurous; he is a lively yet protective companion. He is intelligent, but often stubborn and headstrong. Some can be domineering, but most are biddable, reliable and responsive to their family's wishes. He makes a good house dog as long as he gets daily mental and physical exercise. He likes to be the head dog and may not do well when another dog challenges that position, although they usually get along well with other dogs.","breed":"Airedale Terrier","health":"This is an active breed that needs a chance to get vigorous exercise every day. His needs can be met with a long walk, a strenuous game or a chance to hunt and romp in a safe area. His wire coat needs combing twice weekly, plus scissoring and shaping every one to two months.","energy":"•••••","playfulness":"•••••","dogfriendly":"••","strangerfriendly":"••••","protection":"•••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":3,"url":"https://www.petfinder.com/dog-breeds/Airedale-Terrier"}
{"malehw":"Ht: 25-28, Wt: 85-130","femalehw":"Ht: 23-26, Wt: 65-110","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"•••","coldtolerant":"••••••","care":"As befitting his spitz-like heritage, the Akita is bold, independent, stubborn and tenacious. Demonstrative to his family, he is utterly devoted and will protect family members. Though not the breed for everyone, in the right hands the Akita is an excellent companion.","breed":"Akita","health":"The Akita appreciates mental and physical exercise every day. He needs the chance to run in a safe area or on leash for a long jog. Given ample exercise and training, he can be a quiet and well-mannered house dog. The Akita is happiest if he can spend most of his time with his family. The coat needs brushing about once a week to remove dead hair, more often when shedding. Akitas tend to be somewhat messy drinkers!","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"•••••","heattolerant":"••","exercise":"••••","affection":"••••","index":4,"url":"https://www.petfinder.com/dog-breeds/Akita"}
{"malehw":"Ht: 25, Wt: 85","femalehw":"Ht: 23, Wt: 75","catfriendly":"••","easytraining":"••","watchdog":"••••","grooming":"••••","coldtolerant":"••••••","care":"The Alaskan malamute is powerful, independent, strong-willed and fun-loving. She loves to run and roam. She is family-oriented, and as long as she is given daily exercise, she is well-mannered in the home. Without proper exercise, she can become frustrated and destructive. She is friendly and sociable toward people. Some can be domineering and some may dig and howl.","breed":"Alaskan Malamute","health":"The Alaskan malamute loves cold weather. She can run for miles and needs to have adequate exercise every day, either in the form of a long walk on leash or the opportunity to run or mush. She does better inside during warm weather. Her coat needs brushing once or twice a week, more often when shedding.","energy":"••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"•••••","protection":"••••","heattolerant":"••","exercise":"•••••","affection":"••••••","index":5,"url":"https://www.petfinder.com/dog-breeds/Alaskan-Malamute"}
{"malehw":"Ht: 14.5-15.5, Wt: 24-28","femalehw":"Ht: 13.5-14.5, Wt: 24-28","catfriendly":"••••••","easytraining":"•••••","watchdog":"•••••","grooming":"•••••","coldtolerant":"••••","temperament":"This breed is known as the 'merry' Cocker, and the name is most fitting. He is playful, cheerful, amiable, sweet, sensitive, willing to please and responsive to his family's wishes. He is not known for retaining his hunting instincts, but is inquisitive and will appreciate a country outing. He is equally at home in the city and will happily walk on leash for his exercise needs. Some bark a lot; some are overly submissive.","care":"Although he enjoys a romp, the Cocker can receive adequate exercise with a long daily walk on leash. The coat of the Cocker requires a greater commitment than that of most breeds, although pets can be clipped short. In order to maintain a nice coat, he will need to be brushed and combed two to three times a week, in addition to professional clipping and scissoring every two to three months. Special attention must be paid to ear and eye cleanliness in this breed. The profusely coated feet tend to carry debris. The Cocker is not mentally able to live outside; this is such a social dog that to banish him outdoors would not be acceptable. Cockers have a tendency to become overweight.","breed":"American Cocker Spaniel","health":"Major concerns: cataracts, glaucoma, patellar luxation\nMinor concerns: CHD, ectropion, entropion, PRA, allergies, seborrhea, lip fold pyoderma, otitis externa, liver disease, urolithiasis, prolapse of nictitans gland, CHF, phosphofructokinase deficiency, cardiomyopathy\nOccasionally seen: gastric torsion, elbow dysplasia\nSuggested tests: eye, knee, DNA for phosphofructokinase deficiency, (hip)\nLife span: 12-15 years","energy":"••••","playfulness":"•••••","dogfriendly":"••••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":6,"url":"https://www.petfinder.com/dog-breeds/American-Cocker-Spaniel"}
{"malehw":"Ht: 12-15, Wt: 11-20","femalehw":"Ht: 12-15, Wt: 11-20","catfriendly":"•••••","easytraining":"•••••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••••","temperament":"The American Eskimo is bright, eager to please, lively and fun-loving, in short, an enjoyable and generally obedient companion. True to the Spitz heritage, he is independent and tenacious and loves to run, especially in cold weather. But he is among the most biddable of Spitz breeds, and is calm and well-mannered inside. He is good with children, other dogs, and pets and is generally outgoing to everyone.","care":"The Eskie is energetic and needs a good workout every day. The extent of the workout depends on the size of the dog, with the larger Eskies needing a good jog or long walk and the smaller ones needing only a vigorous game in the yard or short walk. This breed is so attuned to his family that does better indoors. The double coat needs brushing and combing twice weekly, more often when shedding.","breed":"American Eskimo Dog (Miniature)","health":"Major concerns: none\nMinor concerns: patellar luxation\nOccasionally seen: none\nSuggested tests: (knee)\nLife span: 12-14 years","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••","exercise":"••••","affection":"••••","index":7,"url":"https://www.petfinder.com/dog-breeds/American-Eskimo-Dog-(Miniature)"}
{"malehw":"Ht: 15-19, Wt: 20-40","femalehw":"Ht: 15-19, Wt: 20-40","catfriendly":"•••••","easytraining":"•••••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••••","temperament":"The American Eskimo is bright, eager to please, lively and fun-loving in short, an enjoyable and generally obedient companion. True to the Spitz heritage, he is independent and tenacious and loves to run, especially in cold weather. But he is among the most biddable of Spitz breeds, and is calm and well-mannered inside. He is good with children, other dogs, and pets and is generally outgoing to everyone.","care":"The Eskie is energetic and needs a good workout every day. The extent of the workout depends on the size of the dog, with the larger Eskies needing a good jog or long walk and the smaller ones needing only a vigorous game in the yard or short walk. This breed is so attuned to his family that he does better indoors. The double coat needs brushing and combing twice weekly, more often when shedding.","breed":"American Eskimo Dog (Standard)","health":"Major concerns: none\nMinor concerns: patellar luxation\nOccasionally seen: none\nSuggested tests: (knee)\nLife span: 12-14 years","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••","exercise":"••••","affection":"••••","index":8,"url":"https://www.petfinder.com/dog-breeds/American-Eskimo-Dog-(Standard)"}
{"malehw":"Ht: 9-12, Wt: 6-10","femalehw":"Ht: 9-12, Wt: 6-10","catfriendly":"•••••","easytraining":"•••••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••••","temperament":"The American Eskimo is bright, eager to please, lively and fun-loving, in short, an enjoyable and generally obedient companion. True to his Spitz heritage, he is independent and tenacious and loves to run, especially in cold weather. But he is among the most biddable of Spitz breeds, and is calm and well-mannered inside. He is good with children, other dogs, and pets and is generally outgoing to everyone.","care":"The Eskie is energetic and needs a good workout every day. The extent of the workout depends on the size of the dog, with the larger Eskies needing a good jog or long walk and the smaller ones needing only a vigorous game in the yard or short walk. This breed is so attuned to his family that he does better indoors. The double coat needs brushing and combing twice weekly, more often when shedding.","breed":"American Eskimo Dog (Toy)","health":"Major concerns: none\nMinor concerns: patellar luxation\nOccasionally seen: none\nSuggested tests: (knee)\nLife span: 12-14 years","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••","exercise":"••••","affection":"••••","index":9,"url":"https://www.petfinder.com/dog-breeds/American-Eskimo-Dog-(Toy)"}
{"malehw":"Ht: 22-25, Wt: 21-24","femalehw":"Ht: 22-25, Wt: 21-24","catfriendly":"••••","easytraining":"•••","watchdog":"•••••","grooming":"••","coldtolerant":"••••","temperament":"The Foxhound is well-mannered in the home. He gets along best with human or canine companionship. He is a tolerant, amiable and gentle dog, even though he is not very demonstrative. Many are reserved with strangers. He is first and foremost a hunter, ever ready to hit the trail. He needs daily exercise in a safe area. Once on a scent, he will follow gleefully, heedless of commands. This is a dog that likes the outdoors. He bays.","care":"The Foxhound needs daily exercise, preferably in the form of a long walk or jog. If allowed to run off leash, he should only do so in a safe, enclosed area. They are highly sociable, however, and should never be expected to live alone. The coat is easily maintained, requiring only occasional brushing to remove dead hair.","breed":"American Foxhound","health":"Major concerns: none\nMinor concerns: thrombocytopathy \nOccasionally seen: none\nSuggested tests: (blood)\nLife span: 10-13 years","energy":"•••••","playfulness":"••••","dogfriendly":"••••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":10,"url":"https://www.petfinder.com/dog-breeds/American-Foxhound"}
{"malehw":"Ht: 18-19, Wt: 57-67","femalehw":"Ht: 17-18, Wt: 57-67","catfriendly":"••","easytraining":"••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"Typically docile and playful with his family, the American Staffordshire terrier is also generally friendly toward strangers as long as his people are present. He is generally very good with children. He can be stubborn, tenacious and fearless. For all of his tough persona, the most important thing in life to this breed is his family's fond attention.","care":"The Staff needs a daily outlet for his energy, preferably in the form of a long walk on leash or a vigorous game in the yard. This breed is best suited temperamentally to sharing his family's home. Coat care is minimal.","breed":"American Staffordshire Terrier","health":"Major concerns: CHD\nMinor concerns: none\nOccasionally seen: PDA\nSuggested tests: OFA, (cardiac)\nLife span: 12-14 years\nNote: The high pain threshold may mask problems","energy":"••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••••","protection":"••••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":11,"url":"https://www.petfinder.com/dog-breeds/American-Staffordshire-Terrier"}
{"malehw":"Ht: 15-18, Wt: 30-45","femalehw":"Ht: 15-18, Wt: 25-40","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"As his name implies, the American Water Spaniel is a natural lover of water. Not only is he a skilled retriever and versatile hunter, but is also a tractable fun-loving family dog, as long as he gets regular physical and mental exercise. He is sensitive and willing to please. Some can be timid. Generally good with other dogs in the household. Barking can be a definite problem; some also whine or drool.","care":"Like all hunting dogs, the American Water Spaniel needs daily exercise, although these requirements can be met with a long walk. The coat is oily and needs weekly brushing. Hair may be clipped from the feet and topknot. Ears should be checked regularly.","breed":"American Water Spaniel","health":"Major concerns: none\nMinor concerns: lenticular opacities, CHD\nOccasionally seen: patellar luxation, PRA\nSuggested tests: (hip), (eye)\nLife span: 10-12 years","energy":"•••••","playfulness":"•••••","dogfriendly":"•••","strangerfriendly":"•••","protection":"••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":12,"url":"https://www.petfinder.com/dog-breeds/American-Water-Spaniel"}
{"malehw":"Ht: 29, Wt: 110-150","femalehw":"Ht: 27, Wt: 80-120","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"•••","coldtolerant":"•••••","temperament":"This is a serious dog, devoted to his family and his duty as family protector. At the same time, he is laid back-and easygoing, never on the lookout for trouble. He can be suspicious of strangers and can be territorial. He is good with children. As a serious watchdog, he tends to bark a lot when his suspicions are aroused.","care":"The Anatolian shepherd needs a chance to exercise every day, either with a long walk or brisk run. Coat care is minimal, consisting only of a weekly brushing to remove dead hair.","breed":"Anatolian Shepherd","health":"Major concerns: CHD\nMinor concerns: entropion\nOccasionally seen: none\nSuggested tests: hip, (eye)\nLife span: 10-13 years\nNote: sensitive to anesthesia","energy":"••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":13,"url":"https://www.petfinder.com/dog-breeds/Anatolian-Shepherd"}
{"malehw":"Ht: 18-20, Wt: 35-45","femalehw":"Ht: 17-19, Wt: 35-45","catfriendly":"•••","easytraining":"••••••","watchdog":"••••••","grooming":"•••","coldtolerant":"••••","care":"Smart, hardy, independent, stubborn, tenacious, energetic and untiring, these are all traits essential to a driver of headstrong cattle, and all traits of the Australian Cattle Dog. This dog must have a job to do or he will expend his efforts on unacceptable jobs of his own. Given challenging mental and hard physical exercise daily, he is among the most responsive and obedient of dogs, an exemplary partner in adventure. He tends to nip at the heels of running children.","breed":"Australian Cattle Dog","health":"The Australian Cattle Dog was bred to be active and tireless. This dog needs a lot of physical and mental activity, more than a simple walk on a leash can provide. A good jog or long workout, coupled with obedience lessons or other intellectual challenges, is essential every day. The Australian Cattle Dog is happiest when he has a job to perform. The Australian Cattle Dog needs brushing or combing weekly to remove dead hairs.","energy":"••••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"•••••","heattolerant":"••••","exercise":"••••••","affection":"••••","index":14,"url":"https://www.petfinder.com/dog-breeds/Australian-Cattle-Dog"}
{"malehw":"Ht: 20-23, Wt: 50-65","femalehw":"Ht: 18-21, Wt: 40-55","catfriendly":"••••","easytraining":"••••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","care":"The Australian Shepherd has a great deal of stamina and is loving, bold, alert, confident, independent, smart and responsive. If he doesn't get a chance to exercise and challenge his strongly developed mental and physical activities, he is apt to become frustrated and difficult to live with. With proper exercise and training, he is a loyal, utterly devoted and obedient companion. It is reserved with strangers and has a protective nature. It may try to herd children and small animals by nipping.","breed":"Australian Shepherd","health":"This breed needs a good workout every day, preferably combining both physical and mental challenges. Even though he is physically able to live outside in temperate climates, he is a breed for which human contact is so vital that he is emotionally unsuited for a life in the yard. His coat needs brushing or combing one to two times weekly.","energy":"•••••","playfulness":"••••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"•••••","heattolerant":"••••","exercise":"••••••","affection":"•••••","index":15,"url":"https://www.petfinder.com/dog-breeds/Australian-Shepherd"}
{"malehw":"Ht: 10-11, Wt: 12-14","femalehw":"Ht: 10-11, Wt: 12-14","catfriendly":"••••","easytraining":"•••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"One of the quieter terriers, the Aussie is nonetheless a plucky, tough character, ready to go after a rodent when the chance arises. She is fun-loving and adventurous, and needs daily exercise to keep her from becoming frustrated. She is clever and generally eager to please, making her one of the more obedient terriers. She gets along fairly well with other dogs and household pets. Reflecting her earth dog heritage, she does like to dig.","care":"This is an active breed that needs a good outing every day, either a moderate walk, a rollicking game, or an off-lead run in a safe area. She is a good house dog and needs to spend time with her family. Her wire coat needs weekly combing plus twice yearly stripping of dead hairs (regular plucking of dead hairs will keep the coat in optimal condition year round). Some trimming around the feet will add to a tidy look.","breed":"Australian Terrier","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: Legg-Perthes, patellar luxation, diabetes\nSuggested tests: none\nLife span: 12-14 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":16,"url":"https://www.petfinder.com/dog-breeds/Australian-Terrier"}
{"malehw":"Ht: 17, Wt: 24","femalehw":"Ht: 16, Wt: 22","catfriendly":"••","easytraining":"••","watchdog":"••••••","grooming":"••","coldtolerant":"••","temperament":"Some consider the Basenji to have terrier-like mannerisms because he is feisty for a hound. More often he is considered catlike in mannerisms: clever, inquisitive, stubborn, independent and reserved. His hunting roots are very evident, as he loves to chase and trail. He needs regular mental and physical stimulation, lest he become frustrated and destructive. Basenjis may be barkless, but they are not mute. They do make a sort of yodel, howl and shriek and occasionally bark, but just one or two fox barks at a time.","care":"The Basenji is an active dog that needs daily mental and physical exercise. His needs can be met by a long walk followed by a vigorous game, or by running freely in a safe, enclosed area. He does best as an indoor dog with access to a yard. Coat care is minimal, consisting of only occasional brushing to remove dead hair.","breed":"Basenji","health":"Major concerns: Fanconi syndrome, PRA, Basenji enteropathy\nMinor concerns: PPM, PK\nOccasionally seen: CHD\nSuggested tests: eye, DNA test for PK, Fanconi urine test\nLife span: 12-14 years","energy":"•••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":17,"url":"https://www.petfinder.com/dog-breeds/Basenji"}
{"malehw":"Ht: <14, Wt: 40-60","femalehw":"Ht: <14, Wt: 40-60","catfriendly":"••••","easytraining":"•••","watchdog":"•••••","grooming":"•••","coldtolerant":"••••","temperament":"The Basset Hound is among the most good-natured and easygoing of breeds. He is amiable with dogs, other pets and children, although children must be cautioned not to put strain on his back with their games. He is calm inside, but needs regular exercise to keep fit. He prefers to investigate slowly, and loves to sniff and trail. He is a talented and determined tracker, not easily dissuaded from his course. Because of this, he may get on a trail and follow it until he becomes lost. He tends to be stubborn and slow-moving. He has a loud bay that he uses when excited on the trail.","care":"The Basset needs mild daily exercise, which can be satisfied by walking on leash or playing in the yard. He does best as a house dog with access to a yard. His coat needs only minimal grooming, but his face may need regular cleaning around the mouth and wrinkles. Bassets tend to drool.","breed":"Basset Hound","health":"Major concerns: foreleg lameness, OCD, entropion, ectropion, otitis \nexterna, intervertebral disc disease, glaucoma, vWD, CTP, gastric \ntorsion\nMinor concerns: foot cysts and infection\nOccasionally seen: patellar luxation\nSuggested tests: eye, blood\nLife span: 8-12 years\nNote: Obesity is a problem in the breed, especially because it \ncontributes to intervertebral disk disease.","energy":"••","playfulness":"••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••","affection":"••••","index":18,"url":"https://www.petfinder.com/dog-breeds/Basset-Hound"}
{"malehw":"Ht: 13-15, Wt: 18-30","femalehw":"Ht: 13-15, Wt: 18-30","catfriendly":"••••••","easytraining":"••","watchdog":"•••••","grooming":"••","coldtolerant":"••••","care":"One of the most amiable hounds, the Beagle was bred as a pack hunter and needs companionship, whether human or canine. He loves to explore the outdoors and is an enthusiastic trailer. Given adequate exercise, he is a calm, tractable house pet. He is an excellent child's dog, gentle, incredibly tolerant and always ready to join in a game or an adventure. He is an independent breed, however, and may run off if a trail beckons. He barks and howls.","breed":"Beagle","health":"The Beagle needs daily exercise, either a long walk on leash or a romp in a safe area. He is a social dog and needs the companionship of either other dogs or his human family; as such, he is usually happiest if he can divide his time between the house and yard.","energy":"••••","playfulness":"••••","dogfriendly":"••••••","strangerfriendly":"••••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":19,"url":"https://www.petfinder.com/dog-breeds/Beagle"}
{"malehw":"Ht: 21-22, Wt: 45-55","femalehw":"Ht: 20-21, Wt: 45-55","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"•••••","coldtolerant":"•••••","temperament":"The boisterous Beardie is lively and playful, full of enthusiasm and energy. He is smart and obedient, but is an independent thinker with a clownish sense of humor.","care":"This active dog needs either a good jog, a very long walk or a vigorous play session every day. He especially enjoys herding. His long coat needs brushing or combing every other day.","breed":"Bearded Collie","health":"Major concerns: none\nMinor concerns: CHD, epilepsy, colonic disease, pemphigus\nOccasionally seen: CHD, aortic stenosis, PRA, PPM, cataract, vWD\nSuggested tests: hip, (eye), (cardiac)\nLife span: 12-14 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"•••","heattolerant":"••••","exercise":"•••••","affection":"•••••","index":20,"url":"https://www.petfinder.com/dog-breeds/Bearded-Collie"}
{"malehw":"Ht: 16.5, Wt: 17-23","femalehw":"Ht: 15.5, Wt: 17-23","catfriendly":"•••","easytraining":"•••","watchdog":"••••••","grooming":"••••••","coldtolerant":"••••","temperament":"The Bedlington is among the softer terriers, not only in looks and feel but in temperament. She is companionable, demonstrative and loyal. She enjoys her creature comforts and is a fairly quiet house dog. She may give chase to small animals outdoors, but she can usually coexist with them indoors.","care":"The Bedlington needs daily exercise in a safe place; she loves to run and chase. Her needs can be met with a good long walk or vigorous romp. This is not a breed that should live outside. Her coat needs combing once or twice weekly, plus scissoring to shape the coat every other month. Hair that is shed tends to cling to the other hair rather than shedding.","breed":"Bedlington Terrier","health":"Major concerns: copper toxicosis\nMinor concerns: retinal dysplasia, renal cortical hypoplasia, distichiasis\nOccasionally seen: patellar luxation\nSuggested tests: DNA for copper toxicosis, eye\nLife span: 12-14 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":21,"url":"https://www.petfinder.com/dog-breeds/Bedlington-Terrier"}
{"malehw":"Ht: 24-26, Wt: 60-65","femalehw":"Ht: 22-24, Wt: 60-65","catfriendly":"••••","easytraining":"••••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"Intense best describes the Belgian Malinois. This is a high-energy breed with a need for regular mental and physical stimulation. He is alert, smart and serious, an ideal watchdog and guard dog. He can be aloof with strangers and some can be domineering. When confined, he often runs in sweeping circles in an effort to stay on the move. The Malinois is protective of his home and family.","care":"The Malinois is a high-energy dog that needs a lot of exercise. His needs cannot be met with a leisurely walk on leash, and instead needs a good jog or a vigorous play session. He especially enjoys herding. The Malinois needs weekly brushing, more when shedding.","breed":"Belgian Malinois","health":"Major concerns: none\nMinor concerns: CHD, epilepsy, skin allergies\nOccasionally seen: none\nSuggested tests: hip\nLife span: 10-12 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••••••","heattolerant":"••••","exercise":"••••••","affection":"••","index":22,"url":"https://www.petfinder.com/dog-breeds/Belgian-Malinois"}
{"malehw":"Ht: 24-26, Wt: 60-65","femalehw":"Ht: 22-24, Wt: 60-65","catfriendly":"••••","easytraining":"••••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"Ever watchful and on the move, the Belgian Sheepdog glides in large circles. He is playful, alert, watchful and protective, a tough, independent and intense dog. He can be aloof with strangers and some can be domineering. This breed is intelligent and biddable, but independent. He is protective of his home and family.","care":"The Belgian Sheepdog needs a good deal of exercise, either a good long jog or a long, strenuous play session. He needs room to move during the day and does best with access to a yard. His double coat needs brushing and combing twice weekly, more when shedding.","breed":"Belgian Sheepdog","health":"Major concerns: none\nMinor concerns: epilepsy, skin allergies\nOccasionally seen: CHD\nSuggested tests: none\nLife span: 10-12 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••••••","heattolerant":"••••","exercise":"••••••","affection":"••","index":23,"url":"https://www.petfinder.com/dog-breeds/Belgian-Sheepdog"}
{"malehw":"Ht: 24-26, Wt: 60-65","femalehw":"Ht: 22-24, Wt: 60-65","catfriendly":"••••","easytraining":"••••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"Alert, watchful and energetic, the Tervuren is an active and dependable companion that functions best when given daily mental and physical exercise. He enjoys playing and running outside, and can be a well-mannered companion inside as long as he is given sufficient exercise. He is smart and obedient, but independent. He can be aloof with strangers. He may nip at the heels of children in an attempt to herd them.","care":"The Tervuren needs strenuous activity, either a long walk or jog or an invigorating play or work session every day. He especially enjoys herding. His double coat needs brushing and combing twice weekly, more often when shedding.","breed":"Belgian Tervuren","health":"Major concerns: none\nMinor concerns: epilepsy, skin allergies\nOccasionally seen: CHD\nSuggested tests: none\nLife span: 10-12 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••••••","heattolerant":"••••","exercise":"••••••","affection":"••","index":24,"url":"https://www.petfinder.com/dog-breeds/Belgian-Tervuren"}
{"malehw":"Ht: 25-27.5, Wt: 90-120","femalehw":"Ht: 23-26, Wt: 70-100","catfriendly":"•••••","easytraining":"•••••","watchdog":"••••","grooming":"••••","coldtolerant":"••••••","care":"The Bernese mountain dog is an easygoing, calm family companion (that is, after he leaves his adolescent stage). He is sensitive, loyal and extremely devoted. He is gentle with children and often reserved with strangers. He generally gets along well with other dogs and pets.","breed":"Bernese Mountain Dog","health":"This dog enjoys the outdoors, especially in cold weather. He needs daily but moderate exercise, either a good hike or a walk on leash. He is so in tune with his human family that he cannot be relegated to life alone in the yard. Inside, he needs plenty of room to stretch out. His coat needs brushing one or two times weekly, much more often when shedding. The Bernese life span is described by a Swiss expression: \"Three years a young dog, three years a good dog and three years an old dog. All else is a gift from God.\"","energy":"••","playfulness":"•••","dogfriendly":"••••","strangerfriendly":"••••","protection":"•••","heattolerant":"••","exercise":"•••","affection":"••••","index":25,"url":"https://www.petfinder.com/dog-breeds/Bernese-Mountain-Dog"}
{"malehw":"Ht: 9.5-11.5, Wt: 7-12","femalehw":"Ht: 9.5-11.5, Wt: 7-12","catfriendly":"•••••","easytraining":"•••••","watchdog":"•••••","grooming":"••••••","coldtolerant":"••••","care":"Perky, bouncy and playful, the Bichon Frise's happy-go-lucky outlook endears him to all. He is friendly toward strangers and other dogs and pets, and is very good with children. He is sensitive, responsive and affectionate, as eager to cuddle as he is to play. He can bark a lot.","breed":"Bichon Frise","health":"Although small, the Bichon is an active dog and needs daily exercise. His needs can be met with a vigorous indoor game or, better, a romp in the yard or a short walk on leash. The white powder-puff coat needs brushing and combing every other day, plus scissoring and trimming every two months. He doesn't shed, but the loose hairs become entangled in the coat and can mat. He may be difficult to keep white in some areas. This is not a dog that should live outdoors.","energy":"•••••","playfulness":"••••••","dogfriendly":"•••••","strangerfriendly":"••••••","protection":"••","heattolerant":"••••","exercise":"•••","affection":"••••••","index":26,"url":"https://www.petfinder.com/dog-breeds/Bichon-Frise"}
{"malehw":"Ht: 25-27, Wt: 55-75","femalehw":"Ht: 23-25, Wt: 55-75","catfriendly":"••••","easytraining":"••","watchdog":"•••••","grooming":"••","coldtolerant":"••••","temperament":"Not the prototypical house dog, the Black and Tan Coonhound, nonetheless, makes an exemplary pet. He is mellow, amiable, calm and unobtrusive indoors. Outdoors, his strong hunting instincts take over, and he can be difficult, if not impossible, to turn from a track after he starts trailing. As befitting a dog with his heritage, the black and tan is strong, independent and stubborn. He is gentle and tolerant with children and can be reserved with strangers. He may bay and howl.","care":"The Black and Tan is a dog that can run for miles, although he is usually content with a moderate jog or long walk, with an occasional excursion into the field. He can wander if he catches a scent, so a safe area is mandatory. His coat needs only occasional brushing. Most Coonhounds drool to some extent, and the face may need regular wiping. The ears should also be checked regularly.","breed":"Black and Tan Coonhound","health":"Major concerns: CHD\nMinor concerns: ectropion\nOccasionally seen: hemophilia B\nSuggested tests: hip, (eye)\nLife span: 10-12 years","energy":"•••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":27,"url":"https://www.petfinder.com/dog-breeds/Black-and-Tan-Coonhound"}
{"malehw":"Ht: 25-27, Wt: 90-110","femalehw":"Ht: 23-25, Wt: 80-100","catfriendly":"••••••","easytraining":"••","watchdog":"•••••","grooming":"••","coldtolerant":"••••","care":"For all his calm manners at home, the Bloodhound is a tireless trailer once on the track. He is tough, stubborn and independent, yet he is so gentle and placid that he is extremely trustworthy around children. Nonetheless, he is not the lazy old hound dog portrayed in folklore but instead an active, playful companion. Although not the easiest breed to train for traditional obedience, he is exceptionally easy to train in tasks involving trailing. The Bloodhound can be reserved with strangers.","breed":"Bloodhound","health":"As a hunting hound, the Bloodhound needs a good deal of daily exercise. He was bred to trail through any hardship, and once on a trail he cannot be called off. He thus must be exercised in a safe area. The Bloodhound drools a lot, so his facial wrinkles require daily cleaning; the ear tips drag in food and must also be kept clean. The ear canals also need regular cleaning for good health. Coat care is minimal, requiring only occasional brushing or wiping. Most do best as indoor/outdoor dogs; note, however, that this is not the breed for people obsessed with cleanliness in the house!","energy":"••••","playfulness":"••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"•••","exercise":"••••","affection":"••••••","index":28,"url":"https://www.petfinder.com/dog-breeds/Bloodhound"}
{"malehw":"Ht: 20-23, Wt: 30-45","femalehw":"Ht: 18-21, Wt: 30-45","catfriendly":"••","easytraining":"••••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","care":"The Border Collie is a bundle of mental and physical energy awaiting its chance to be unleashed on the world. Among the most intelligent and obedient of breeds. Given sufficient exercise, he is a dependable and loyal companion. He is intent on whatever he does and tends to stare, which can be unnerving to other animals. He also likes to chase other animals. He is reserved, even protective, toward strangers.","breed":"Border Collie","health":"Few dogs are as work-oriented as the Border Collie. This is a dog that needs a job. He needs a lot of physical and mental activity every day to satisfy his quest for work. He enjoys being with his family. Its coat needs brushing or combing twice weekly.","energy":"••••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••••","heattolerant":"••••","exercise":"••••••","affection":"••••","index":29,"url":"https://www.petfinder.com/dog-breeds/Border-Collie"}
{"malehw":"Ht: 10-11, Wt: 13-15.5","femalehw":"Ht: 10-11, Wt: 11.5-14","catfriendly":"•••","easytraining":"•••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"One of the few terriers bred to run with the pack, the border is one of the most amiable and tractable of the group. He is inquisitive, busy, friendly and biddable. He does like to hunt and can be independent, ingredients that make for a dog that may tend to roam if given the chance. He is generally good with other dogs and cats, but not with rodents. He is very good with children and makes a good companion for people of all ages. He digs, and some bark. Some are talented escape artists.","care":"The border likes activity and needs either a good walk on leash, a vigorous game session or an off-lead expedition in a safe area every day. He does best when allowed to divide his time between house and yard. His harsh coat needs brushing weekly, plus stripping of dead hairs about four times yearly to maintain his clean outline.","breed":"Border Terrier","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: CHD, heart defects\nSuggested tests: hip, cardiac\nLife span: 12-15 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":30,"url":"https://www.petfinder.com/dog-breeds/Border-Terrier"}
{"malehw":"Ht: >28, Wt: 75-105","femalehw":"Ht: >26, Wt: 60-85","catfriendly":"•••","easytraining":"••••","watchdog":"•••","grooming":"••••","coldtolerant":"•••••","temperament":"A breed of quiet elegance, the Borzoi exemplifies the well-mannered house dog. Outdoors, he races with wild abandon, and it will chase any small animal that runs. He is independent but very sensitive. Although generally good with children and some can be timid. He is reserved with strangers.","care":"The Borzoi needs the chance to exert itself daily. Although a long walk can satisfy most of his needs, it should be combined with a sprint in a large safe area. The coat, which is characteristically fuller on males, needs brushing or combing two or three times a week; at times he sheds a lot. Borzois do best as house dogs with access to a yard.","breed":"Borzoi","health":"Major concerns: gastric torsion\nMinor concerns: none\nOccasionally seen: none\nSuggested tests: none\nLife span: 10-12 years\nNote: sensitive to anesthesia","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••••","heattolerant":"•••","exercise":"••••","affection":"••••","index":31,"url":"https://www.petfinder.com/dog-breeds/Borzoi"}
{"malehw":"Ht: 15-17, Wt: 10-25","femalehw":"Ht: 15-17, Wt: 10-25","catfriendly":"•••••","easytraining":"••••","watchdog":"••••••","grooming":"••","coldtolerant":"••","care":"The Boston is devoted and sensitive to its owner's wishes and moods. He is well-mannered indoors but saucy and playful (especially enjoying ball chasing) whenever the chance arises. Somewhat stubborn, he is nonetheless clever and learns readily. Some bark a lot.","breed":"Boston Terrier","health":"This is a lively dog that needs daily exercise and interaction with his people. He loves games, and most of his exercise requirements can be met with a romp in the yard or a short walk on leash. He cannot live outdoors. Some Bostons wheeze and snore, and many don't tolerate heat well. The coat requires only minimal care, an occasional brushing to remove dead hairs.","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••","exercise":"••","affection":"••••","index":32,"url":"https://www.petfinder.com/dog-breeds/Boston-Terrier"}
{"malehw":"Ht: 24.5-27.5, Wt: 69-90","femalehw":"Ht: 23.5-26.5, Wt: 69-90","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"•••••","coldtolerant":"•••••","temperament":"The Bouvier is a steady, stalwart companion that is loyal, devoted, fearless and protective. Given daily exercise, he is calm and well-mannered indoors, but ready for an adventure in the great outdoors. He is independent and confident of his own judgment, yet biddable and willing to please. He is reserved, even protective, toward strangers and can be aggressive with strange dogs. He is very good with children, although he may nip at heels in play.","care":"The Bouvier des Flandres is not a breed that can be put aside until the mood strikes to play with him. He needs daily exercise and daily interaction, and a lot of both. He loves the chance to herd, but his requirements can also be met with a good jog, a very long walk or a vigorous play session. He makes a good house dog and would enjoy access to both house and yard. His harsh coat needs combing once or twice weekly, plus scissoring and shaping every three months.","breed":"Bouvier des Flandres","health":"Major concerns: CHD\nMinor concerns: gastric torsion\nOccasionally seen: entropion\nSuggested tests: hip\nLife span: 10-12 years","energy":"••••","playfulness":"•••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••••••","heattolerant":"•••","exercise":"•••••","affection":"••••","index":33,"url":"https://www.petfinder.com/dog-breeds/Bouvier-des-Flandres"}
{"malehw":"Ht: 22.5-25, Wt: 65-80","femalehw":"Ht: 21-23.5, Wt: 50-65","catfriendly":"••••","easytraining":"••••","watchdog":"••••","grooming":"••","coldtolerant":"•••","care":"The boxer is playful, exuberant, inquisitive, attentive, demonstrative, devoted and outgoing; he is a perfect companion for an active family. He can be stubborn, but he is sensitive and responsive to commands. He is generally good with other household dogs and pets.","breed":"Boxer","health":"The boxer needs daily mental and physical exertion. He likes to run, but his exercise needs can also be met with a good jog or a long walk on leash. He does not do well in hot weather and is generally unsuited to living outdoors. He does best when allowed to divide his time between a house and yard. Some snore. His coat needs only occasional brushing to remove dead hair.","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••••","heattolerant":"••","exercise":"••••","affection":"••••••","index":34,"url":"https://www.petfinder.com/dog-breeds/Boxer"}
{"malehw":"Ht: 23-27, Wt: 75-100","femalehw":"Ht: 22-25.5, Wt: 75-100","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"•••••","coldtolerant":"••••","care":"Devoted and faithful, the Briard is a loving and protective companion. He is independent, intelligent and self-assured, but is also willing to please and eager to serve as a partner in adventure. He can be reserved with strangers. He tends to stay at home and may attempt to keep the family's children home as well!","breed":"Briard","health":"This is a dog that needs a good amount of activity and interaction every day. He can be satisfied with a long walk or jog, or a long play session coupled with a little training. Its long coat needs brushing or combing every other day or mats can form.","energy":"••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"•••","exercise":"•••••","affection":"••••","index":35,"url":"https://www.petfinder.com/dog-breeds/Briard"}
{"malehw":"Ht: 17.5-20.5, Wt: 30-40","femalehw":"Ht: 17.5-20.5, Wt: 30-40","catfriendly":"••••","easytraining":"•••••","watchdog":"•••••","grooming":"••","coldtolerant":"••••","care":"The Brittany is quick and curious, always on the lookout for birds or fun. She loves to run, scout, hunt and play. She has an independent nature, befitting any pointing breed, yet she is sensitive and very responsive to human direction. The Brittany makes a good house pet, as long as she receives daily mental and physical exercise. If not given sufficient exercise, she can become destructive.","breed":"Brittany","health":"The Brittany is generally a hardy dog that requires little maintenance. Her major requirement is for abundant exercise, at least an hour of exertion every day. She is a social dog that needs human interaction. Her coat is not particularly thick or long, but it does require brushing once or twice weekly.","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••••","protection":"••","heattolerant":"••••","exercise":"••••••","affection":"••••••","index":36,"url":"https://www.petfinder.com/dog-breeds/Brittany"}
{"malehw":"Ht: 7-8, Wt: 8-10","femalehw":"Ht: 7-8, Wt: 8-10","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"••","coldtolerant":"•••","temperament":"The spunky Brussels griffon is full of himself, brimming with self-confidence and gusto. He is bold, playful, stubborn and mischievous. He is usually good with other dogs and pets. He tends to bark and climb, and some Brussels griffons can be escape artists. This breed makes a saucy companion for a family wanting an entertaining, sensitive pet.","care":"The Brussels griffon is an active breed, always on the lookout for action. He needs daily mental and physical stimulation, but his small size makes such stimulation possible with a robust indoor game. He also enjoys a short walk on leash. This breed cannot live outside, although he appreciates the opportunity to spend time in the yard. The rough coat needs combing two or three times weekly, plus shaping by stripping every three months. Grooming for the smooth coat is minimal, consisting only of occasional brushing to remove dead hair.","breed":"Brussels Griffon","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: weak bladder, patellar luxation, distichiasis\nSuggested tests: none\nLife span: 12-15 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"•••","exercise":"•••","affection":"•••••","index":37,"url":"https://www.petfinder.com/dog-breeds/Brussels-Griffon"}
{"malehw":"Ht: 21-22, Wt: 55-65","femalehw":"Ht: 21-22, Wt: 45-55","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"Exuberant, comical, playful, assertive and very mischievous describes the bull terrier. He is an imaginative breed that often sees things his own way and is stubborn to the end. He needs daily physical and mental exercise lest he exercise his powerful jaws on your home. For all his tough bravado, this is an extremely sweet-natured, affectionate and devoted breed.","care":"The bull terrier needs to be entertained, either with a good exercise session or mental stimulation every day, preferably both. This is an active breed that enjoys a good run, but he is best to run only in a safe area. He should not stay outdoors, but he should live primarily as a house dog with access to a yard. Coat care is minimal.","breed":"Bull Terrier","health":"Major concerns: deafness (whites), kidney problems\nMinor concerns: heart problems, patellar luxation\nOccasionally seen: lens luxation\nSuggested tests: hearing (whites), UP:UC ratio for kidney function, cardiac, (eye)\nLife span: 11-14 years","energy":"•••••","playfulness":"••••••","dogfriendly":"••","strangerfriendly":"••••","protection":"•••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":38,"url":"https://www.petfinder.com/dog-breeds/Bull-Terrier"}
{"malehw":"Ht: 12-15, Wt: 50","femalehw":"Ht: 12-15, Wt: 40","catfriendly":"•••••","easytraining":"•••","watchdog":"••","grooming":"•••","coldtolerant":"••","care":"Despite his sourmug the Bulldog is jovial, comical and amiable, among the most docile and mellow of dogs. He is willing to please, although he retains a stubborn streak. The bulldog is very good with children. Most are moderately friendly toward strangers. The breed is quite good with other pets.","breed":"Bulldog","health":"The Bulldog appreciates a daily outing but cannot tolerate hot humid weather and should not be expected to jog or walk great distances, or to jump from any heights. Most Bulldogs cannot swim. Most Bulldogs wheeze and snore, and some drool. Coat care is minimal, but facial wrinkles (and any folds around the tail) should be cleaned daily.","energy":"••","playfulness":"•••••","dogfriendly":"••","strangerfriendly":"•••••","protection":"•••","heattolerant":"••","exercise":"••","affection":"••••••","index":39,"url":"https://www.petfinder.com/dog-breeds/Bulldog"}
{"malehw":"Ht: 25-27, Wt: 110-130","femalehw":"Ht: 24-26, Wt: 100-120","catfriendly":"•••••","easytraining":"••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"The bullmastiff is gentle and quiet, a devoted companion and guardian. He is not easily roused, but once threatened he is fearless. He is stubborn and cannot easily be goaded into action against his will. He is generally good with other household dogs and pets. He is good with children. The bullmastiff needs a firm but loving home. He is not for fragile or timid pet parents.","care":"The bullmastiff is a big dog and needs daily exercise to stay in shape. His needs are moderate, however, and can be met with walks on leash and short romps. He does not do well in hot, humid weather and generally should be kept as an indoor dog. He needs a soft bed and plenty of room to stretch out. He drools; some snore. Coat care is minimal.","breed":"Bullmastiff","health":"Major concerns: gastric torsion, CHD, elbow dysplasia\nMinor concerns: entropion\nOccasionally seen: PRA\nSuggested tests: hip, elbow, (eye)\nLife span: 8-10 years","energy":"••","playfulness":"••","dogfriendly":"•••","strangerfriendly":"••","protection":"••••••","heattolerant":"••","exercise":"•••","affection":"••••","index":40,"url":"https://www.petfinder.com/dog-breeds/Bullmastiff"}
{"malehw":"Ht: 10, Wt: 14","femalehw":"Ht: 9.5, Wt: 13","catfriendly":"••","easytraining":"••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","care":"The cairn is the essence of terrier; plucky, spirited, bold, inquisitive, hardy, clever, stubborn and scrappy. He is responsive to the wishes of his people, however, and tries to please; in fact, he is surprisingly sensitive. This breed is a good house pet as long as he is given daily physical and mental exercise in a safe area. He enjoys playing with children and is tough enough to withstand some roughhousing. He can chase small animals, he loves to sniff, explore and hunt. He digs; some bark.","breed":"Cairn Terrier","health":"Despite his small size, the cairn needs outdoor exercise every day, either a moderate walk on leash, a fun game in the yard or an excursion in a safe area. He does best indoors. His wire coat needs combing once weekly, plus stripping of dead hair at least twice yearly.","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":41,"url":"https://www.petfinder.com/dog-breeds/Cairn-Terrier"}
{"malehw":"Ht: 20-24, Wt: 45-55","femalehw":"Ht: 19-23, Wt: 35-45","catfriendly":"•••••","easytraining":"•••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"Not only does the Canaan Dog excel as a herder, but he has also proven himself in a variety of tasks involving dependability and obedience. This is an intelligent, devoted, docile dog that is quite tractable and willing to please. He can be aloof toward strangers and protective of his family. The Canaan Dog is generally good with other household pets and dogs. He is a natural guardian and tends to bark a lot.","care":"Few breeds can claim as pure a working heritage as the Canaan Dog. This dog will not be happy just sitting around. He needs lots of exercise and mental and physical challenges. These needs can be met with herding exercise, a long jog, or a strenuous game session along with a challenging training session. He makes an excellent house dog. His coat needs brushing about once a week to remove dead hairs.","breed":"Canaan Dog","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: none\nSuggested tests: none\nLife span: 12-13 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":42,"url":"https://www.petfinder.com/dog-breeds/Canaan-Dog"}
{"malehw":"Ht: 10.5-12.5, Wt: 30-38","femalehw":"Ht: 10.5-12.5, Wt: 25-34","catfriendly":"•••••","easytraining":"•••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"Fun-loving and high-spirited, yet easygoing, the Cardigan is a devoted and amusing companion. This is a hardy breed, capable of a day dodging cow kicks, so he is agile and tireless. At home he is well-mannered but inclined to bark. He tends to be reserved with strangers.","care":"The Cardigan needs a surprising amount of exercise for its size. His needs can best be met with a moderate walk or vigorous play session. He is a very good house dog and best when he is allowed access to both house and yard. His coat needs brushing once a week to remove dead hair.","breed":"Cardigan Welsh Corgi","health":"Major concerns: CHD\nMinor concerns: PRA\nOccasionally seen: urolithiasis, PRA\nSuggested tests: hip, (eye), (DNA test for PRA)\nLife span: 10-12 years","energy":"••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••••","protection":"•••••","heattolerant":"••••","exercise":"•••","affection":"••••","index":43,"url":"https://www.petfinder.com/dog-breeds/Cardigan-Welsh-Corgi"}
{"malehw":"Ht: 12-13, Wt: 13-18","femalehw":"Ht: 12-13, Wt: 13-18","catfriendly":"•••••","easytraining":"•••••","watchdog":"••••","grooming":"••••","coldtolerant":"••••","care":"The cavalier in many ways fits the bill as an ideal house pet. He is sweet, gentle, playful, willing to please, affectionate and quiet. He is amiable toward other dogs, pets and strangers. Outdoors, his spaniel heritage kicks in, and he loves to explore, sniff and chase.","breed":"Cavalier King Charles Spaniel","health":"The cavalier needs a fair amount of exercise every day, either in the form of a moderate walk on leash or a romp in a safe area. This is not a breed that should live outdoors. His long coat needs brushing every other day.","energy":"••••","playfulness":"•••••","dogfriendly":"••","strangerfriendly":"••••••","protection":"••","heattolerant":"•••","exercise":"••••","affection":"••••••","index":44,"url":"https://www.petfinder.com/dog-breeds/Cavalier-King-Charles-Spaniel"}
{"malehw":"Ht: 23-26, Wt: 65-80","femalehw":"Ht: 21-24, Wt: 55-70","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"•••","coldtolerant":"•••••","temperament":"The Chesapeake Bay retriever is hardy enough to not only withstand, but also relish, repeated plunges into icy water. He loves to swim and retrieve. Despite an active life when outdoors, inside he tends to be calm. The Chessie tends to be independent, although eager to learn. He can be reserved with strangers and can be protective. This is the hardiest, most strong-willed and protective of the retriever breeds.","care":"The Chessie is a large active dog that needs a daily chance to exercise. He enjoys a good walk or swim and more than anything, prefers to spend time with his family. The oily, wavy coat needs weekly brushing but is generally easily maintained. He seldom needs washing; in fact, it's hard to get a Chessie wet! Bathing destroys the coats oils and thus, \nits water resistance.","breed":"Chesapeake Bay Retriever","health":"Major concerns: CHD, gastric torsion\nMinor concerns: PRA\nOccasionally seen: entropion, OCD, elbow dysplasia, cerebellar abiotrophy\nSuggested tests: hip, eye\nLife span: 10-13 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":45,"url":"https://www.petfinder.com/dog-breeds/Chesapeake-Bay-Retriever"}
{"malehw":"Ht: 6-9, Wt: <6","femalehw":"Ht: 6-9, Wt: <6","catfriendly":"••••","easytraining":"•••","watchdog":"••••••","grooming":"••","coldtolerant":"••","temperament":"The saucy Chihuahua has earned her place as a favored toy dog because of her intense devotion to a single person. She is reserved with strangers but good with other household dogs and pets. Some try to be protective, but they are not very effective. Some may be quite bold; others may be timid. She is often temperamental. Some bark.","care":"The Chihuahua is a lively dog that nonetheless can get her exercise running from room to room indoors. She enjoys exploring the yard or going for short walks on a leash and especially enjoys accompanying her family on outings. The Chihuahua is not an outdoor dog; she hates the cold and seeks out warmth. Coat care for the smooth is minimal. Care of the long coat entails brushing two to three times a week.","breed":"Chihuahua","health":"Major concerns: none\nMinor concerns: pulmonic stenosis, hydrocephalus, patellar luxation, KCS, \nhypoglycemia\nOccasionally seen: none\nSuggested tests: cardiac, knee\nLife span: 14-18 years\nNote: A soft spot (molera) in the skull (due to incomplete fontanel closure) is a common \nbreed trait.","energy":"••••••","playfulness":"•••","dogfriendly":"••","strangerfriendly":"••","protection":"••","heattolerant":"•••••","exercise":"••","affection":"•••","index":46,"url":"https://www.petfinder.com/dog-breeds/Chihuahua"}
{"malehw":"Ht: 11-13, Wt: 5-12","femalehw":"Ht: 11-13, Wt: 5-12","catfriendly":"••••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••","care":"The Chinese crested is a combination of playful pixie, gentle lap dog and sensitive companion. She is devoted to her family and willing to please; she is also good with other dogs, pets and strangers. Her demeanor should be gay and alert.","breed":"Chinese Crested Dog","health":"The crested enjoys a romp outside, but she hates the cold. She is small enough that she can get sufficient exercise with vigorous inside games. Hairless varieties will need a sweater for cold-weather outings. This is not a breed for outdoor living. Chinese crested dogs are gifted jumpers and some climb. Coat care for the powder-puff variety entails brushing every day or two. The muzzle is usually shaved every two weeks in puffs. The hairless needs regular skin care, such as the application of moisturizer or sunblock, and bathing to combat blackheads.","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••••","protection":"••","heattolerant":"•••••","exercise":"••","affection":"•••••","index":47,"url":"https://www.petfinder.com/dog-breeds/Chinese-Crested-Dog"}
{"malehw":"Ht: 18-20, Wt: 45-60","femalehw":"Ht: 18-20, Wt: 45-60","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"•••","coldtolerant":"••••","temperament":"The Shar-Pei is self-assured, serious, independent, stubborn and very much self-possessed. Although not particularly demonstrative, he is devoted and very protective of his family. He can be reserved, even suspicious, toward strangers. The Shar-Pei may chase livestock and other animals, although he is generally good with other family pets. The Shar-Pei needs daily mental and physical stimulation, but his needs can be met with lively games throughout the day or a good long walk. He is not generally amenable to exclusive outdoor living, but can divide his time between house and yard. The coat needs only weekly brushing, but wrinkles need regular attention to ensure that no irritations develop within the skin folds.","care":"The name Shar-Pei means sandy coat, referring to the gritty sandpaper texture of the coat. When rubbed backward, the prickly coat can be uncomfortable, and even cause welts on the skin of an occasional sensitive person.","breed":"Chinese Shar-Pei","health":"Major concerns: entropion, CHD\nMinor concerns: patellar luxation, elbow dysplasia, demodectic mange\nOccasionally seen: ciliary dyskinesia, renal amoidosis\nSuggested tests: hip, knee, elbow, (eye)\nLife span: 8-10 year\ns\nNote: The breed is susceptible to fevers of unknown origin, often \noccurring with swollen hocks.","energy":"••••","playfulness":"••","dogfriendly":"••","strangerfriendly":"••","protection":"•••••","heattolerant":"•••","exercise":"••••","affection":"••","index":48,"url":"https://www.petfinder.com/dog-breeds/Chinese-Shar-Pei"}
{"malehw":"Ht: 17-20, Wt: 45-70","femalehw":"Ht: 17-20, Wt: 45-70","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"•••","coldtolerant":"••••••","care":"Dignified, even lordly, the chow chow conducts himself with reserve. He is not very demonstrative, even with his family, and can be somewhat suspicious of strangers. He is independent and stubborn and is generally good with other household pets. The Chow Chow is serious and protective, devoted to his family.","breed":"Chow Chow","health":"This is an alert breed that needs regular, but not strenuous, outdoor activity. He does not do well in hot humid weather. His needs are best met with casual morning or evening walks in warm weather or several short play sessions throughout the day. The smooth type needs brushing once weekly; the rough type needs brushing every other day, and daily when shedding.","energy":"••","playfulness":"••","dogfriendly":"••","strangerfriendly":"••","protection":"•••••","heattolerant":"••","exercise":"•••","affection":"•••","index":49,"url":"https://www.petfinder.com/dog-breeds/Chow-Chow"}
{"malehw":"Ht: 19-20, Wt: 70-85","femalehw":"Ht: 17-19, Wt: 55-70","catfriendly":"•••••","easytraining":"••••","watchdog":"•••","grooming":"••••","coldtolerant":"••••","temperament":"Among the most low-keyed and easygoing of sporting breeds, the clumber spaniel is nonetheless a hunter at heart, ever ready for a day in the field. At home he tends to be quiet and may even need to be goaded into exercise. The clumber spaniel is suitable for city life, although he will relish walks and outings. He makes a good pet, especially devoted to one person.","care":"The clumber enjoys a daily outing, but his exercise requirements can be met with a long walk on leash or a leisurely hike in the field. The coat needs brushing two to three times weekly, although in dirty areas he may need more frequent bathing in order to keep his coat a gleaming white. Clumbers tend to drool and, at times, snore.","breed":"Clumber Spaniel","health":"Major concerns: CHD, entropion\nMinor concerns: intervertebral disc problems, ectropion\nOccasionally seen: epilepsy\nSuggested tests: hip, eye\nLife span: 10-12 years","energy":"•••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"•••","exercise":"•••","affection":"•••••","index":50,"url":"https://www.petfinder.com/dog-breeds/Clumber-Spaniel"}
{"malehw":"Ht: 24-26, Wt: 60-75","femalehw":"Ht: 22-24, Wt: 50-65","catfriendly":"•••••","easytraining":"••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","care":"The Collie is gentle and devoted, a mild-mannered friend to all. He is a dog with a working heritage, and needs daily mental and physical exercise or he can become frustrated. He is sensitive, intelligent and willing to please, although he is sometimes a bit stubborn. He can nip at heels in play. Some may bark a lot.","breed":"Collie","health":"A good walk or jog on leash or a fun play session is needed every day. The collie is such a family-oriented dog that he is far happier indoors. The coat of the smooth variety needs minimal care; the coat of the rough variety needs brushing or combing every other day, more when shedding.","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••••","heattolerant":"•••","exercise":"••••","affection":"••••","index":51,"url":"https://www.petfinder.com/dog-breeds/Collie"}
{"malehw":"Ht: 25-27, Wt: 60-70","femalehw":"Ht: 23-25, Wt: 60-70","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••","coldtolerant":"•••••","temperament":"The curly-coated retriever is an eager and tireless land and, especially, water retriever outdoors, but a calm companion indoors. She is sensitive and gentle, very good with children, and responsive to commands. One of the most courageous of the retrievers, she is nonetheless quite sensitive. She makes an ideal partner for an active, outdoor-oriented person who also wants a loyal family companion.","care":"The curly is an easy dog to maintain, requiring no unusual care. She needs daily exercise, preferably involving swimming and retrieving. She does best as an indoor, outdoor dog. Because brushing diminishes the tight curls, she should be combed only occasionally, preferably before getting wet. Some very minimal scissoring may be desirable to tidy up scraggly hairs. She does need regular brushing during her shedding seasons.","breed":"Curly-Coated Retriever","health":"Major concerns: CHD\nMinor concerns: none\nOccasionally seen: distichiasis, cataract\nSuggested tests: hip\nLife span: 8-12 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"•••","heattolerant":"••••","exercise":"••••","affection":"••••","index":52,"url":"https://www.petfinder.com/dog-breeds/Curly-Coated-Retriever"}
{"malehw":"Ht: 8-9, Wt: 11-32","femalehw":"Ht: 8-9, Wt: 11-32","catfriendly":"•••","easytraining":"•••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","care":"The Dachshund is bold, curious and always up for adventure. He likes to hunt and dig, tracking by scent and going to ground after game. He is independent but will join in his family's activities whenever given a chance. He is good with children in his own family. Some bark. The longhaired variety may be quieter and less terrier-like; the wires may be more outgoing. Some miniatures are more prone to be timid.","breed":"Dachshund (Standard)","health":"Although Dachshunds are active, their exercise requirements can be met with moderate walks on leash and games in the yard. The Dachshund is amenable to city life or apartment living, but he is still a hunter at heart and enjoys forays into the wilds. The smooth coat requires minimal grooming. The long coat requires brushing or combing once or twice weekly and occasional trimming of stray hairs. The wire coat requires brushing or combing about once a week, with occasional trimming of stray hairs and stripping to remove dead hair twice a year.","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"•••","heattolerant":"••••","exercise":"•••","affection":"••••","index":53,"url":"https://www.petfinder.com/dog-breeds/Dachshund-(Standard)"}
{"malehw":"Ht: 5-6, Wt: 1-11","femalehw":"Ht: 5-6, Wt: 1-11","catfriendly":"•••","easytraining":"•••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"The Dachshund is bold, curious and always up for adventure. He likes to hunt and dig, tracking by scent and going to ground after game. He is independent but will join in its family's activities whenever given a chance. He is good with children in his own family. Some bark. The longhaired variety may be quieter and less terrier-like; the wires may be more outgoing. Some miniatures are more prone to be timid.","care":"Although Dachsunds are active, their exercise requirements can be met with moderate walks on leash and games in the yard. The Dachsund is amenable to city life or apartment living, but he is still a hunter at heart and enjoys forays into the wilds. The smooth coat requires minimal grooming. The long coat requires brushing or combing once or twice weekly and occasional trimming of stray hairs. The wire coat requires brushing or combing about once a week, with occasional trimming of stray hairs and stripping to remove dead hair twice a year.","breed":"Dachsund (Miniature)","health":"Major concerns: intervertebral disc disease\nMinor concerns: KCS\nOccasionally seen: diabetes, epilepsy, patellar luxation, deafness, \ngastric torsion\nSuggested tests: (eye)\nLife span: 12-14 years\nNote: Obesity is a major problem for the dachshund. Many dachshunds \ntend to be overweight, which in turn predisposes them to \nintervertebral disc disease.","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"•••","heattolerant":"••••","exercise":"•••","affection":"••••","index":54,"url":"https://www.petfinder.com/dog-breeds/Dachsund-(Miniature)"}
{"malehw":"Ht: 19-23, Wt: 40-60","femalehw":"Ht: 19-23, Wt: 40-60","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"•••","coldtolerant":"•••","care":"Bred to run for miles, the Dalmatian retains this tireless enthusiasm. It is a playful, eager companion that must get daily hard exercise in a safe area if he is expected to behave at home. He loves to run and may roam. He is generally good with other pets and is especially good with horses. He tends to be reserved toward strangers. He can be stubborn.\nNote: Deaf Dalmatians present special training and behavioral problems. They are not advised for families with children.","breed":"Dalmatian","health":"The Dalmatian needs a lot of regular exercise and attention. He needs more than a short walk on leash; he makes a good jogging companion. The Dalmatian's needs can also be met with vigorous games and runs. Although the Dal needs shelter, soft bedding and, most of all, companionship. Thus, he is best allowed to live in the house and play in the yard. The coat needs only minimal care, but more frequent brushing will help remove dead hair.","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":55,"url":"https://www.petfinder.com/dog-breeds/Dalmatian"}
{"malehw":"Ht: 8-11, Wt: 18-24","femalehw":"Ht: 8-11, Wt: 18-24","catfriendly":"••••","easytraining":"•••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"The Dandie Dinmont is no \"dandified\" dog; she is rough-and-tumble and ready for the hunt. Yet she functions well as a dignified house pet, affectionate but not doting. She is a loyal companion suitable for people of all ages, but she does need daily exercise to keep her from becoming frustrated. She is intelligent and very independent. Some dig.","care":"The Dandie enjoys the chance to hunt around and explore in a safe area and needs a moderate walk to stay in condition. She does best as an indoor/outdoor dog, and should sleep inside. Her coat needs combing twice weekly, plus regular scissoring and shaping. Shaping for show dogs is done on an almost continual (but light) basis; that for pets can be done by stripping or clipping about four times a year.","breed":"Dandie Dinmont Terrier","health":"Major concerns: intervertebral disc disease\nMinor concerns: shoulder and elbow luxation\nOccasionally seen: patellar luxation, otitis externa\nSuggested tests: (elbow)\nLife span: 11-13 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":56,"url":"https://www.petfinder.com/dog-breeds/Dandie-Dinmont-Terrier"}
{"malehw":"Ht: 26-28, Wt: 65-90","femalehw":"Ht: 24-26, Wt: 65-90","catfriendly":"••••","easytraining":"••••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","care":"The Doberman pinscher is an intelligent capable guardian, ever on the alert and ready to protect her family or home. She is also a loyal and adventurous companion. She likes to be mentally challenged and is a gifted obedience pupil. She is sensitive and very responsive to her family's wishes, though some can be domineering. She is generally reserved with strangers.","breed":"Doberman Pinscher","health":"This is an active breed that needs daily mental and physical exercise, lest she become frustrated or destructive. Her exercise requirements can be met with a long jog or walk on leash, or a strenuous run in a safe area. The Doberman is a better companion and effective guardian if she shares her human's home. Coat care is minimal.","energy":"•••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":57,"url":"https://www.petfinder.com/dog-breeds/Doberman-Pinscher"}
{"malehw":"Ht: 16-17, Wt: 28-34","femalehw":"Ht: 15-16, Wt: 26-32","catfriendly":"••••••","easytraining":"•••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"The English cocker spaniel retains more of her hunting nature than does the American version, and she also needs a little more exercise. She is cheerful, inquisitive, demonstrative, devoted, biddable, loyal and sensitive. This is a sociable dog that likes to stay close to her human family.","care":"Daily exercise is a necessity, either in the form of a long walk on leash, a good run in the field or a lively game in the yard. The English cocker is such a social dog that she does best living inside and playing outside. The medium-length coat needs brushing two to three times per week, plus clipping around the head and ears scissoring around the feet and tail every two months. The ears should be cleaned weekly.","breed":"English Cocker Spaniel","health":"Major concerns: PRA\nMinor concerns: cataracts, CHD, familial nephropathy\nOccasionally seen: glaucoma, cardiomyopathy\nSuggested tests: hearing (for particolors), eye, hip, (knee)\nLife span: 12-14 years\nNote: deafness is a major concern in particolors; CHD is more common in solid colors; PRA is of PRCD type","energy":"••••","playfulness":"•••••","dogfriendly":"••••••","strangerfriendly":"•••••","protection":"•••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":58,"url":"https://www.petfinder.com/dog-breeds/English-Cocker-Spaniel"}
{"malehw":"Ht: 23-27, Wt: 55-75","femalehw":"Ht: 23-27, Wt: 55-75","catfriendly":"••••","easytraining":"•••","watchdog":"•••••","grooming":"••","coldtolerant":"••••","temperament":"Traditionally a pack hound, the English Foxhound nonetheless makes a stately house dog, as long as he has human or canine companionship. He gets along well with horses, dogs, children and other pets. He is an avid sniffer and trailer, however, and needs daily exercise in a safe area. He is a tolerant, amiable and gentle dog, even though he is not very demonstrative. He bays.","care":"The Foxhound is an easygoing dog that nonetheless needs plenty of exercise. He is bred to run for miles, and can make a good jogging companion on leash or a hiking companion in a safe area. The coat needs only occasional brushing to remove dead hair.","breed":"English Foxhound","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: CHD, renal disease\nSuggested tests: none\nLife span: 10-13 years","energy":"•••••","playfulness":"••••","dogfriendly":"••••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":59,"url":"https://www.petfinder.com/dog-breeds/English-Foxhound-"}
{"malehw":"Ht: 25, Wt: 60-65","femalehw":"Ht: 24, Wt: 50-55","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"Bred to cover a lot of area when hunting, the English setter is a lively dog that loves to hunt and run. This is especially true of dogs from field lines. If not given sufficient exercise, they can be overly lively inside. With daily exertion, however, they are calm and tractable house dogs. Those from conformation lines are particularly laid-back and gentle and excel with children and less active adults. This is an amiable, easygoing breed that gets along well with children, strangers and other dogs.","care":"The English setter needs a lot of exercise every day, requiring at least an hour of hard exertion. He does best when he can live inside and play outside. The long coat needs regular brushing every two or three days. The white coat may be difficult to keep gleaming in some areas. Some clipping and trimming every month or two is advisable for optimal good looks.","breed":"English Setter","health":"Major concerns: deafness, CHD, elbow dysplasia\nMinor concerns: PRA, OCD\nOccasionally seen: epilepsy\nSuggested tests: hip, elbow, hearing, eye\nLife span: 10-14 years","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••••","protection":"•••","heattolerant":"••••","exercise":"•••••","affection":"•••••","index":60,"url":"https://www.petfinder.com/dog-breeds/English-Setter"}
{"malehw":"Ht: 19-21, Wt: 50","femalehw":"Ht: 18-20, Wt: 40","catfriendly":"••••••","easytraining":"••••••","watchdog":"•••••","grooming":"•••••","coldtolerant":"••••","care":"The English springer spaniel is cheerful, playful and energetic, ready for a day in the field and an evening by the hearth. He does everything with gusto and can be overly enthusiastic unless given plenty of exercise. The typical springer is the ideal family companion.","breed":"English Springer Spaniel","health":"As an energetic and inquisitive dog, the springer needs daily mental and physical exertion. An outing in the field, long walk on leash and good obedience lesson can go far to making the springer a calm and well-behaved house dog. This breed does best if allowed to live in the house with access to a yard. His coat needs brushing or combing one or two times weekly plus clipping and scissoring every three months. Springers from field, rather than show, lines tend to have less coat.","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"•••","heattolerant":"••••","exercise":"•••••","affection":"••••••","index":61,"url":"https://www.petfinder.com/dog-breeds/English-Springer-Spaniel"}
{"malehw":"Ht: 10-11, Wt: 8-14","femalehw":"Ht: 10-11, Wt: 8-14","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"The haughty English toy spaniel enjoys a life of leisure, punctuated with rollicking romps. He is a lap dog par excellence, gentle, amiable, calm and quiet, yet he is playful and attentive. He is utterly devoted to his family and reserved with strangers. He can be somewhat stubborn.","care":"Although he enjoys a nice walk on leash or a fun game in the house or yard, the English toy spaniel is not overly active and his exercise needs can be met with minimal effort. He does not do well in heat and is temperamentally unsuited for living outside away from his family. His long coat needs combing twice weekly.","breed":"English Toy Spaniel","health":"Major concerns: patellar luxation\nMinor concerns: early tooth loss, \"lazy\" tongue (never fully extracts into mouth)\nOccasionally seen: PDA\nSuggested tests: knee\nLife span: 10-12 years\nNote: A soft spot in the skull (due to incomplete fontanel closure) sometimes occurs. The breed is sensitive to anesthesia.","energy":"••","playfulness":"••••","dogfriendly":"•••••","strangerfriendly":"•••","protection":"••","heattolerant":"••","exercise":"••","affection":"•••","index":62,"url":"https://www.petfinder.com/dog-breeds/English-Toy-Spaniel"}
{"malehw":"Ht: 18, Wt: 35-50","femalehw":"Ht: 17, Wt: 35-50","catfriendly":"••••••","easytraining":"•••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"The field spaniel is happiest when he has a job to do. Although independent in nature, he is devoted, sensitive and willing to please. Always cheerful and affectionate, he is an excellent family companion as long as he is given regular exercise. The field spaniel is especially known for his tractable nature. It is typical for a field spaniel to be somewhat reserved with strangers.","care":"The field spaniel needs daily exercise, and even though he is happiest when given the chance to run and explore, his needs can be met with a long walk on leash. He does best when allowed to divide his time between house and yard. He thrives on human companionship and should not be deprived of his family. His coat needs brushing and combing once or twice weekly. Straggling hairs should be scissored every few months. The ears should be checked and cleaned regularly. Some can be somewhat sloppy, and some snore.","breed":"Field Spaniel","health":"Major concerns: CHD\nMinor concerns: otitis externa, patellar luxation\nOccasionally seen: PRA, SAS\nSuggested tests: hip, eye\nLife span: 12-14 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••••","protection":"•••","heattolerant":"••••","exercise":"•••••","affection":"••••••","index":63,"url":"https://www.petfinder.com/dog-breeds/Field-Spaniel"}
{"malehw":"Ht: 17.5-20, Wt: 31-36","femalehw":"Ht: 15.5-18, Wt: 23-29","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"•••••","temperament":"Like most Spitz breeds, the Finkie is independent and somewhat stubborn, although he is more hunting oriented than other Spitz breeds. He is alert, inquisitive and playful, but is also sensitive, tending to be devoted to one person. He is a breed conscious of his place in the dominance hierarchy, and some males can try to be domineering. He is good with children, and generally good with other pets. He can be reserved, even aloof or suspicious, with strangers. In keeping with his barking heritage, the Finkie is proud of his barking ability and likes to show it off loudly!","care":"This is an active and lively breed that needs daily exercise, either a long walk on leash or a run in a fenced area. As Finkies are hunters by nature, care must be taken that they do not go off on a hunt by themselves. The Finkie enjoys living indoors. His double coat needs brushing one or two times weekly, more often when shedding. He is not oily, so the Finkie has little doggy odor; in fact, the Finkie is a particularly clean breed.","breed":"Finnish Spitz","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: CHD, patellar luxation, epilepsy\nSuggested tests: none\nLife span: 12-14 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••••","heattolerant":"•••","exercise":"••••","affection":"••••","index":64,"url":"https://www.petfinder.com/dog-breeds/Finnish-Spitz"}
{"malehw":"Ht: 23-24.5, Wt: 60-70","femalehw":"Ht: 22-23.5, Wt: 60-70","catfriendly":"•••••","easytraining":"••••••","watchdog":"•••••","grooming":"•••","coldtolerant":"••••","temperament":"The flat-coated retriever is a sweet, exuberant, lively dog that loves to play and retrieve. She is on the go outdoors, but quiet indoors. This breed is among the most devoted and companionable of dogs, a true family dog. She needs regular exercise to be on her best behavior, however. She is a sensitive breed and very responsive to training. Her hallmark is her wagging tail.","care":"This active dog needs daily exercise and fun, and especially enjoys the chance to hunt or swim. This is a family-oriented dog that does best when allowed to live inside and play outside. Her coat needs only weekly brushing and little, if any, minor trimming occasionally.","breed":"Flat-Coated Retriever","health":"Major concerns: none\nMinor concerns: CHD\nOccasionally seen: PRA, epilepsy, diabetes\nSuggested tests: (hip), (knee), (eye)\nLife span: 10-14 years","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"•••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":65,"url":"https://www.petfinder.com/dog-breeds/Flat-Coated-Retriever"}
{"malehw":"Ht: 11-13, Wt: <28","femalehw":"Ht: 11-13, Wt: <28","catfriendly":"•••••","easytraining":"•••","watchdog":"••••","grooming":"••","coldtolerant":"••••","care":"The French Bulldog is a clown in a lap dog. He enjoys playing and entertaining his family, as well as cuddling and snoozing with his favorite person. He is amiable, sweet, companionable and willing to please.","breed":"French Bulldog","health":"The Frenchie has minimal exercise requirements, although he is a fun-loving dog. He enjoys a romp outdoors, but doesn't do well in hot, humid weather. Most cannot swim. A short walk on lead is sufficient to meet most of his physical needs. This breed should not live outdoors. The Frenchie snores and may wheeze and drool. He requires minimal coat care, but his facial wrinkles should be regularly cleaned.","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"••","exercise":"••","affection":"••••","index":66,"url":"https://www.petfinder.com/dog-breeds/French-Bulldog"}
{"malehw":"Ht: 24-26, Wt: 75-95","femalehw":"Ht: 22-24, Wt: 75-95","catfriendly":"••••","easytraining":"••••••","watchdog":"••••••","grooming":"•••","coldtolerant":"••••","care":"Among the most intelligent of breeds, the German Shepherd Dog is so intent on his mission whatever that may be and he is virtually unsurpassed in working versatility. He is utterly devoted and faithful. He is usually good with other pets.","breed":"German Shepherd Dog","health":"This breed needs daily mental and physical challenges. He enjoys a good exercise session as well as learning session. He is family-oriented and does well as a house dog. His coat needs brushing one or two times weekly.","energy":"••••","playfulness":"•••","dogfriendly":"••","strangerfriendly":"•••","protection":"••••••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":67,"url":"https://www.petfinder.com/dog-breeds/German-Shepherd-Dog"}
{"malehw":"Ht: 23-25, Wt: 55-70","femalehw":"Ht: 21-23, Wt: 45-60","catfriendly":"•••","easytraining":"••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"The German shorthaired pointer's idea of heaven is a day hunting in the field and an evening curled up by his family's side. This is an active dog that can become frustrated and \"creative\" if not given ample daily exercise, both mental and physical. He is a devoted family pet, although at times he is overly boisterous for small children. Because part of his heritage includes hunting mammals, some may not be good with small pets. He is a sensitive breed, responsive to gentle training. Some can whine or bark a lot.","care":"Bred to be an active hunting companion, this breed has a good deal of energy and requires a good deal of exercise. He thrives on mental and physical stimulation and can get both by hunting, hiking or playing with his people for a long period, at least an hour, every day. They like water and will swim if given the chance. This is a companionable breed that does best when allowed to live in the house with access to a yard. His grooming needs are minimal, consisting only of occasional brushing to remove dead hair.","breed":"German Shorthaired Pointer","health":"Major concerns: lymphedema\nMinor concerns: CHD, entropion, gastric torsion, vWD, pannus, OCD\nOccasionally seen: gastric torsion, ectropion, PRA\nSuggested tests: hip, eye, (blood)\nLife span: 12-14 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••••","heattolerant":"••••","exercise":"••••••","affection":"•••••","index":68,"url":"https://www.petfinder.com/dog-breeds/German-Shorthaired-Pointer"}
{"malehw":"Ht: 24-26, Wt: 45-75","femalehw":"Ht: >22, Wt: 45-75","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"The German wirehaired pointer is both a rugged bird dog and amiable companion. He has the energy to hunt for hours, so he must be given a daily outlet lest he becomes destructive. He is a responsive breed, although he tends to be stubborn. He retains a guarding instinct, so he is often aloof, even protective, toward strangers as well as strange dogs. He is generally good, if sometimes overly boisterous, with children. He is ideal for the outdoor-oriented person wanting a tireless, intelligent partner.","care":"Exercise is a daily requirement for this energetic hunter. At least an hour a day of exertion is recommended. As a breed that thrives on human companionship, he does best as a house dog with access to the outdoors. Like most harsh coats, some minimal hand-stripping may occasionally be needed to maintain a sleek outline; otherwise, brushing about once a week will suffice.","breed":"German Wirehaired Pointer","health":"Major concerns: CHD\nMinor concerns: elbow dysplasia\nOccasionally seen: none\nSuggested tests: hip, elbow\nLife span: 12-14 years","energy":"••••••","playfulness":"•••••","dogfriendly":"•••","strangerfriendly":"•••","protection":"•••••","heattolerant":"••••","exercise":"••••••","affection":"••••","index":69,"url":"https://www.petfinder.com/dog-breeds/German-Wirehaired-Pointer"}
{"malehw":"Ht: 25.5-27.5, Wt: 65-90","femalehw":"Ht: 23.5-25.5, Wt: 65-90","catfriendly":"•••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"The playful, rambunctious giant schnauzer may be too boisterous for small children, even though he is otherwise very good with children in his own family. He is bold and protective of his family and reserved with strangers. This intelligent and exuberant breed is a good choice for an active person wanting a partner in adventure, although at times the giant may try to be the leader.","care":"The giant schnauzer needs daily exercise and fun. His exercise requirements can be met with vigorous games and long hikes or walks. He does best when allowed to divide his time between house and yard. His harsh coat needs combing once or twice weekly, plus shaping two to four times yearly. Shaping is best done by professional scissoring and hand-stripping, but clipping is acceptable for pets.","breed":"Giant Schnauzer","health":"Major concerns: CHD\nMinor concerns: OCD, gastric torsion\nOccasionally seen: none\nSuggested tests: hip\nLife span: 10-12 years","energy":"••••","playfulness":"•••••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"••••","exercise":"•••••","affection":"••","index":70,"url":"https://www.petfinder.com/dog-breeds/Giant-Schnauzer"}
{"malehw":"Ht: 23-24, Wt: 65-75","femalehw":"Ht: 21.5-22.5, Wt: 55-65","catfriendly":"••••••","easytraining":"••••••","watchdog":"••••","grooming":"••••","coldtolerant":"••••","care":"Everybody's friend, the golden retriever is known for her devoted and obedient nature as a family companion. She is an apt sporting retriever as well and yearns for a day in the field. Ignoring her active nature and powerful physique can lead to behavior problems, and she needs daily physical and mental exercise. She tends to be overly exuberant and boisterous, and her enthusiasm for everything often distracts her during training; however, she is eager to please and enjoys learning. The golden's achievements in competitive obedience are remarkable. She especially enjoys games that involve retrieving and loves to carry items in her mouth.","breed":"Golden Retriever","health":"The golden retriever needs daily exercise and human interaction. Challenging obedience lessons, active games or retrieving sessions are all good ways to exercise the golden's mind and body. She is such a social dog that she is best when she shares her life with her family. The coat does not tend to mat but needs twice weekly brushing.","energy":"••••","playfulness":"••••••","dogfriendly":"••••••","strangerfriendly":"••••••","protection":"•••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":71,"url":"https://www.petfinder.com/dog-breeds/Golden-Retriever"}
{"malehw":"Ht: 24-27, Wt: 55-80","femalehw":"Ht: 23-26, Wt: 45-70","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"The Gordon setter is a capable, close-working bird dog. He can run and hunt all day, and this kind of energy needs a regular outlet or the dog is apt to become frustrated. Gordons make lively, enthusiastic companions and need the company of lively people. Somewhat more protective than the other setters, they can be reserved toward strangers. The Gordon has earned his reputation as a devoted family dog.","care":"The Gordon needs much strenuous exercise every day in order to stay in shape. He must be able to spend ample time with people and does best dividing his time between inside and outside. His coat needs regular brushing and combing every two to three days. In addition, some \nclipping and trimming is needed for optimal good looks.","breed":"Gordon Setter","health":"Major concerns: CHD, gastric torsion\nMinor concerns: PRA, elbow dysplasia\nOccasionally seen: cerebellar abiotrophy\nSuggested tests: hip, elbow, eye\nLife span: 10-12 years","energy":"•••••","playfulness":"••••","dogfriendly":"•••","strangerfriendly":"•••","protection":"••••","heattolerant":"••••","exercise":"•••••","affection":"•••••","index":72,"url":"https://www.petfinder.com/dog-breeds/Gordon-Setter"}
{"malehw":"Ht: 30-32, Wt: 100-120","femalehw":"Ht: 28-30, Wt: 100-120","catfriendly":"••••","easytraining":"•••••","watchdog":"•••••","grooming":"••","coldtolerant":"•••","care":"The Great Dane is gentle, loving, easygoing and sensitive. She is generally good with children (although her friendly overtures may overwhelm a small child) and usually friendly toward other dogs and pets. She is powerful but sensitive and responsive to training. She makes a pleasant, well-mannered family companion.","breed":"Great Dane","health":"The Great Dane needs daily moderate exercise. Her needs can be met with a good walk or romp. Despite her sturdy appearance, she is not suited to living outdoors and is best suited to dividing her time between indoors and out. Inside, she needs soft bedding and sufficient room to stretch out when sleeping. Some tend to drool. Coat care is minimal.","energy":"•••","playfulness":"•••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••••","heattolerant":"•••","exercise":"••••","affection":"•••••","index":73,"url":"https://www.petfinder.com/dog-breeds/Great-Dane"}
{"malehw":"Ht: 27-32, Wt: 100","femalehw":"Ht: 25-29, Wt: 85","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••••","temperament":"The Great Pyrenees is a capable and imposing guardian, devoted to her family and somewhat wary of strangers, human or canine. When not provoked, she is calm, well-mannered and somewhat serious. She is very gentle with her family and children. She has an independent, somewhat stubborn, nature and may try to dominate a less secure handler. Some are not good off leash and may wander away. The Great Pyrenees tends to bark a lot.","care":"The Great Pyrenees needs daily exercise to stay in shape, though her needs are not excessive. A moderate walk will usually suffice. She enjoys hiking, especially in cold weather and snow. She does not do well in hot weather. This breed enjoys being with her family indoors. Her coat needs brushing once or twice weekly, daily when shedding. She may drool at times, and she tends to be a messy drinker.","breed":"Great Pyrenees","health":"Major concerns: CHD, patellar luxation\nMinor concerns: entropion, OCD, skin problems, osteosarcoma\nOccasionally seen: ChD, gastric torsion, otitis externa, panosteitis\nSuggested tests: hip, knee, (eye)\nLife span: 10-12 years","energy":"••","playfulness":"•••","dogfriendly":"•••","strangerfriendly":"•••","protection":"•••••","heattolerant":"••","exercise":"••••","affection":"••••","index":74,"url":"https://www.petfinder.com/dog-breeds/Great-Pyrenees"}
{"malehw":"Ht: 25.5-28.5, Wt: 105-140","femalehw":"Ht: 23.5-27, Wt: 85-110","catfriendly":"•••••","easytraining":"•••••","watchdog":"•••••","grooming":"••","coldtolerant":"•••••","temperament":"The Greater Swiss mountain dog is a sensitive, loyal and extremely devoted family companion. He is calm and easygoing, very gentle with children as well as other pets. He is protective, alert, bold and vigilant.","care":"As befitting of a dog with working roots, this breed likes the outdoors, especially in cold weather. He needs daily exercise, either a good long walk or vigorous romp. When indoors, he needs plenty of room to stretch out. His coat needs brushing once weekly, more often when shedding.","breed":"Greater Swiss Mountain Dog","health":"Major concerns: CHD, gastric torsion, elbow dysplasia\nMinor concerns: panosteitis, OCD, distichiasis, entropion\nOccasionally seen: ectropion\nSuggested tests: hip, elbow, (eye)\nLife span: 10-12 years","energy":"•••","playfulness":"•••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••••","heattolerant":"•••","exercise":"••••","affection":"••••","index":75,"url":"https://www.petfinder.com/dog-breeds/Greater-Swiss-Mountain-Dog"}
{"malehw":"Ht: 27-30, Wt: 65-70","femalehw":"Ht: 27-30, Wt: 60-65","catfriendly":"•••","easytraining":"••••","watchdog":"•••••","grooming":"••","coldtolerant":"••","temperament":"Known as \"the world's fastest couch potato,\" the Greyhound is quiet, calm and extremely well-mannered indoors. They are good with other dogs, and with other pets if raised with them; outdoors, they tend to chase any small thing that moves. They are very sensitive and sometimes timid. Despite their independent nature, they are eager to please.","care":"The Greyhound needs daily exercise, but he is a sprinter, not an endurance runner. His needs can thus be met with a chance to run, or by a longer walk on leash. He loves to run and chase outdoors, and can easily run into danger at great speed unless exercised in a safe area. He is not amenable to living outdoors. Greyhounds relish creature comforts and must have soft bedding and warmth. The coat is extremely easy to care for, needing only occasional brushing to remove dead hair.","breed":"Greyhound","health":"Major concerns: none\nMinor concerns: esophageal achalasia, gastric torsion, osteosarcoma\nOccasionally seen: none\nSuggested tests: none\nLife span: 10-13 years\nNote: Racing injuries especially toe, hock and muscle injuries are \ncommon in retired NGA dogs. Both NGA and AKC Greyhounds are sensitive \nto anesthesia and are prone to lacerations and tail-tip injuries.","energy":"•••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"•••","heattolerant":"•••","exercise":"••••","affection":"••••","index":76,"url":"https://www.petfinder.com/dog-breeds/Greyhound"}
{"malehw":"Ht: 19-21, Wt: 50-60","femalehw":"Ht: 19-21, Wt: 50-60","catfriendly":"••••","easytraining":"•••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"The Harrier is somewhat more playful and outgoing than the foxhound, but not as much as the beagle. He is amiable, tolerant and good with children. His first love is for the hunt, and he loves to sniff and trail. He needs daily exercise in a safe area. He tends to bay.","care":"The Harrier needs daily exercise, but his needs can be met with a long walk or jog and a vigorous game in the yard. The coat is easily cared for, needing only occasional brushing to remove dead hair.","breed":"Harrier","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: none\nSuggested tests: none\nLife span: 10-12 years","energy":"•••••","playfulness":"••••","dogfriendly":"••••••","strangerfriendly":"•••","protection":"••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":77,"url":"https://www.petfinder.com/dog-breeds/Harrier"}
{"malehw":"Ht: 8.5-11.5, Wt: 7-13","femalehw":"Ht: 8.5-11.5, Wt: 7-13","catfriendly":"•••••","easytraining":"•••••","watchdog":"•••••","grooming":"••••","coldtolerant":"•••","care":"This is a busy, curious dog; she is happiest when she is the center of attention. She loves to play and clown and is affectionate with her family, children, strangers, other dogs and pets, basically everyone! The Havanese is willing to please and learn easily, but she tends to be vocal.","breed":"Havanese","health":"Although energetic, the Havanese can have her exercise needs met with a short walk or a good play session. She is not a dog that can live outside. Coat care entails brushing two to four times a week. This is a nonshedding dog, which means that loose hairs are caught in the outer hairs, tending to tangle, unless they are combed out.","energy":"•••••","playfulness":"••••••","dogfriendly":"•••••","strangerfriendly":"••••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":78,"url":"https://www.petfinder.com/dog-breeds/Havanese"}
{"malehw":"Ht: 23.5-27.5, Wt: 50","femalehw":"Ht: 22.5-26, Wt: 45","catfriendly":"••••","easytraining":"•••","watchdog":"•••••","grooming":"••","coldtolerant":"•••","temperament":"The graceful Ibizan Hound retains great hunting instinct, using his acute senses of hearing and smell to locate small animals, and relishing the opportunity to chase anything that moves. Unlike most Sighthounds, he barks when chasing. He is gentle, mild-mannered, even-tempered and loyal, and makes a quiet, trustworthy house pet.","care":"As an independent and athletic dog, the Ibizan Hound needs daily exercise in a safe area. Ideal exercise allows the dog to stretch out at full speed, but his needs can also be met with long walks or jogs on leash, combined with an occasional chance to run full out. The Ibizan is not kept as an outside dog and he is a skilled jumper, which should be taken into consideration when designing an enclosure. The smooth coat requires only occasional brushing, whereas the wire coat requires weekly brushing as well as occasional hand-plucking of dead hairs.","breed":"Ibizan Hound","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: deafness\nSuggested tests: none\nLife span: 12-14 years\nNote: sensitive to anesthesia","energy":"••••","playfulness":"••••","dogfriendly":"•••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••","index":79,"url":"https://www.petfinder.com/dog-breeds/Ibizan-Hound"}
{"malehw":"Ht: 27, Wt: 70","femalehw":"Ht: 25, Wt: 60","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","care":"The Irish setter was bred to be a tireless and enthusiastic hunter, and she approaches everything in life with a rollicking, good-natured attitude, full of gusto and fervor. Given a daily outlet for her energy, she makes a pleasant companion. Without ample exercise, she can be overly active inside or become frustrated. She is an amiable breed, eager to please and be part of her family's activities. She is good with children. She is less popular as a hunter than the other setters.","breed":"Irish Setter","health":"The Irish needs exercise, and lots of it. It is not fair to take a dog selected for boundless energy and expect her to sit inside. A minimum of one hour of hard strenuous games and exertion a day is recommended. The is such a sociable dog that she does best living with her family. Her coat needs regular brushing and combing every two to three days, plus some clipping and trimming to looks her best.","energy":"••••••","playfulness":"••••••","dogfriendly":"•••••","strangerfriendly":"••••••","protection":"••","heattolerant":"••••","exercise":"••••••","affection":"••••••","index":80,"url":"https://www.petfinder.com/dog-breeds/Irish-Setter"}
{"malehw":"Ht: 18, Wt: 27","femalehw":"Ht: 18, Wt: 25","catfriendly":"••","easytraining":"••","watchdog":"••••••","grooming":"•••••","coldtolerant":"••••","temperament":"Called the daredevil of dogdom, the Irish terrier is brash, bold, assertive, playful, inquisitive, independent, strong-willed and ever ready for action and adventure. He likes to chase and run and hunt and explore; he needs daily physical and mental exercise in a safe area. Given sufficient exercise, he is surprisingly well-mannered and dignified indoors. He is a loyal and entertaining companion.","care":"This is a dog with an active mind and body. He needs daily entertainment and exercise. He makes a good walking and jogging companion, as well as hiking or hunting partner. His needs can also be met with a rigorous play session. His wire coat needs combing one or two times weekly, plus scissoring and shaping two to four times yearly.","breed":"Irish Terrier","health":"Major concerns: none\nMinor concerns: urolithiasis\nOccasionally seen: none\nSuggested tests: none\nLife span: 12-15 years","energy":"••••","playfulness":"••••••","dogfriendly":"••","strangerfriendly":"•••","protection":"•••••","heattolerant":"••••","exercise":"••••","affection":"•••","index":81,"url":"https://www.petfinder.com/dog-breeds/Irish-Terrier"}
{"malehw":"Ht: 22-24, Wt: 55-65","femalehw":"Ht: 21-23, Wt: 45-58","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"The Irish water spaniel goes at everything in life with gusto and enthusiasm. He loves to swim, run, hunt and play and needs a lot of exercise. A clown at heart, he can be stubborn and independent, so he needs to be trained with patience, firmness and a sense of humor. He is generally good with children, though some can be timid.","care":"This active, athletic, inquisitive breed needs lots of mental and physical exertion to keep him from becoming frustrated or bored. An hour of free running or strenuous playing a day is necessary to satisfy his needs. Obedience work can also be helpful in giving him the mental challenges he enjoys. The curly coat needs brushing and combing two to three times a week, plus scissoring every few months. Like all dogs, he loses his coat periodically; however, the hairs tend to become trapped in the other hairs rather than fall off. If not combed out, they will form mats and cords.","breed":"Irish Water Spaniel","health":"Major concerns: CHD\nMinor concerns: none\nOccasionally seen: none\nSuggested tests: hip\nLife span: 10-12 years","energy":"••••","playfulness":"••••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":82,"url":"https://www.petfinder.com/dog-breeds/Irish-Water-Spaniel"}
{"malehw":"Ht: >32, Wt: >120","femalehw":"Ht: >30, Wt: >105","catfriendly":"••••","easytraining":"•••","watchdog":"••••","grooming":"••••","coldtolerant":"•••••","temperament":"Aptly known as the gentle giant, the Irish Wolfhound is a soft-natured, easygoing breed. He is calm around the house, sensitive, patient, easygoing and sweet. Despite his great size, he is good with children, pets and other dogs. It can be reserved with strangers and courageous when the need arises.","care":"The Irish Wolfhound enjoys a long walk and a chance to stretch its legs, so he needs daily exercise. At home the Wolfhound needs ample room to stretch out on a soft surface and should not be required to live in cramped quarters. He can develop callouses if allowed to lie on hard surfaces too often. His coat needs to be brushed or combed once or twice weekly, plus occasional slight scissoring to neaten up straggly hairs. Dead hairs should be stripped twice a year.","breed":"Irish Wolfhound","health":"Major concerns: gastric torsion\nMinor concerns: cardiomyopathy, OCD, osteosarcoma, CHD\nOccasionally seen: none\nSuggested tests: (hip), (heart)\nLife span: 5-7 years\nNote: sensitive to anesthesia; prone to tail-tip injuries","energy":"••","playfulness":"••","dogfriendly":"••••","strangerfriendly":"••••","protection":"•••","heattolerant":"••","exercise":"••••","affection":"••••","index":83,"url":"https://www.petfinder.com/dog-breeds/Irish-Wolfhound"}
{"malehw":"Ht: 13-15, Wt: 7-14","femalehw":"Ht: 13-15, Wt: 7-14","catfriendly":"•••••","easytraining":"••••","watchdog":"••••","grooming":"••","coldtolerant":"••","care":"A sighthound in a small package, the Italian greyhound shares her larger relatives' characteristics. She loves to run and chase. She is extremely gentle and sensitive. Reserved, often timid, with strangers, she is devoted to her family and is good with children, and other dogs and pets. However, she can be easily injured by boisterous children and larger dogs.","breed":"Italian Greyhound","health":"The Italian greyhound likes a daily romp outdoors, but she hates the cold. Her exercise needs are best met with a good walk on leash or even a rollicking game indoors. She also likes to stretch out and sprint in a fenced area. This breed cannot live outdoors. Care of the fine short hair is minimal, consisting only of occasional brushing to remove dead hair. Regular brushing of the teeth is important in this breed.","energy":"•••••","playfulness":"••••","dogfriendly":"•••••","strangerfriendly":"•••","protection":"••","heattolerant":"•••••","exercise":"•••","affection":"••••••","index":84,"url":"https://www.petfinder.com/dog-breeds/Italian-Greyhound"}
{"malehw":"Ht: 12-14, Wt: 13-17","femalehw":"Ht: 12-14, Wt: 13-17","catfriendly":"••","easytraining":"••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","care":"This is a dog that thrives on action and adventure. In the process, he often finds himself in the middle of trouble. He is a true hunter at heart and will explore, wander, chase and dig when he gets a chance. He is very playful and intelligent. He gets along well with children and strangers. He does well with horses, but he may chase cats and is not good with rodents. He may tend to bark and dig. He makes an ideal companion for an active person with a good sense of humor who wants a lot of entertainment-and mischief-in one dog.","breed":"Jack Russell Terrier","health":"The Jack Russell needs a lot of mental and physical stimulation every day. He is not a dog that can sit around inside. He needs a long walk or strenuous game every day, plus a short training session. He enjoys the chance to explore on his own, but he must do so only in a safe area because he tends to go off in search of trouble, and some go down holes and must be dug out! He does best when allowed access to a house and yard. Coat care for the smooth type consists only of weekly brushing to remove dead hair; for the broken coat he also consists of occasional hand stripping.","energy":"••••••","playfulness":"••••••","dogfriendly":"•••","strangerfriendly":"••••","protection":"•••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":85,"url":"https://www.petfinder.com/dog-breeds/Jack-Russell-Terrier"}
{"malehw":"Ht: 8-11, Wt: 4-7","femalehw":"Ht: 8-11, Wt: 4-7","catfriendly":"•••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••","temperament":"The Japanese Chin is a devoted companion, relishing a warm lap as much as a boisterous game. He is sensitive and willing to please, tending to shadow his family. He is a friend to all: strangers, dogs and pets. His playfulness and gentleness make him a good child's companion for equally gentle children. The breed has been described as almost catlike, some even climb.","care":"The Japanese Chin is lively but small enough that his exercise needs can be met with a short walk, romp or game. This is not a breed that can live outside. He does not do well in hot humid weather. Some Chins tend to wheeze. The long coat needs combing twice weekly.","breed":"Japanese Chin","health":"Major concerns: none\nMinor concerns: patellar luxation, KCS, entropion\nOccasionally seen: achondroplasia, epilepsy\nSuggested tests: knee, (eye)\nLife span: 12-14 years\nNote: The breed is sensitive to anesthesia and does not tolerate heat well. He is also prone to corneal abrasions.","energy":"••••","playfulness":"•••••","dogfriendly":"•••••","strangerfriendly":"••••••","protection":"••","heattolerant":"•••","exercise":"••","affection":"••••••","index":86,"url":"https://www.petfinder.com/dog-breeds/Japanese-Chin"}
{"malehw":"Ht: 17-19, Wt: 45","femalehw":"Ht: 16-18, Wt: 35","catfriendly":"•••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••••","temperament":"The Keeshond combines many traits of the best house dogs: fairly energetic and playful, very attentive and loving, and ready for adventure yet content to take it easy. He is sensitive and learns readily. He makes a good companion for a child or adult. He is friendly to all but, nonetheless, an alert watchdog.","care":"This is a lively breed that can have his exercise needs met with moderate exercise, such as a good walk on leash, combined with a vigorous game. He is such a sociable dog that he prefers to share his life with his family. The double coat needs brushing once or twice weekly, and more when shedding.","breed":"Keeshond","health":"Major concerns: none\nMinor concerns: CHD, epilepsy, skin problems\nOccasionally seen: renal cortical hypoplasia, tetralogy of Fallot, \nmitral valve insufficiency\nSuggested tests: hip, (cardiac)\nLife span: 12-14 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••","exercise":"••••","affection":"••••••","index":87,"url":"https://www.petfinder.com/dog-breeds/Keeshond"}
{"malehw":"Ht: 18-19.5, Wt: 33-40","femalehw":"Ht: 17.5-19, Wt: <33-40","catfriendly":"••","easytraining":"••","watchdog":"••••••","grooming":"••••••","coldtolerant":"••••","temperament":"A versatile terrier, the Kerry blue's personality is multifaceted. She can guard, hunt, herd or just be a fun-loving companion. She needs daily mental and physical activity in a safe area. She loves to run, chase, hunt, explore, play and dig. Indoors, She is well-mannered. She can be protective toward strangers yet greet verified friends with great enthusiasm. She is clever and independent, often stubborn. Some tend to bark.","care":"The Kerry blue needs a good amount of exercise, but her needs can be met with either a long walk on leash, a vigorous play session or a chance to explore off leash in a safe area. Her coat needs combing about twice a week, plus scissoring and coat shaping every month.","breed":"Kerry Blue Terrier","health":"Major concerns: PNA, cerebellar abiotrophy\nMinor concerns: cataract, spiculosis, hair follicle tumors, entropion, KCS, narrow palpebral fissure distichiasis, CHD\nOccasionally seen: retinal folds\nSuggested tests: eye, (hip)\nLife span: 12-15 years","energy":"••••","playfulness":"•••••","dogfriendly":"••","strangerfriendly":"••","protection":"•••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":88,"url":"https://www.petfinder.com/dog-breeds/Kerry-Blue-Terrier"}
{"malehw":"Ht: 27.5, Wt: 80","femalehw":"Ht: 25.5, Wt: 70","catfriendly":"•••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••••","temperament":"Bred as an independent protector of livestock, the komondor is true to his heritage. He is an independent thinker and can be stubborn or domineering. He is not for meek people who can be dominated and socialization is essential. He is good with other pets and especially livestock. In fact, he is happiest when he has something or someone to watch over. Although usually calm and quiet, he is utterly fearless when the need arises. As a natural guardian, he is protective of children in his own family, but he may at times misunderstand rough-and-tumble games of visiting children.","care":"The komondor needs daily exercise in the form of long walks or short romps. Swimming is not a good idea because of the time it takes the coat to dry. It may also be difficult to keep the coat clean in some areas. This breed does not like warm weather. The komondor is nonshedding but not carefree. His cords must be regularly separated or they will look like flat mats, and his coat tends to hold dirt; bathing is time-consuming and drying takes as much as a day. Pets can be clipped but then lose part of the breed's unique appeal. Note that it may take a dog up to 2 years of age before cords form.","breed":"Komondor","health":"Major concerns: CHD, gastric torsion\nMinor concerns: otitis externa, acute moist dermatitis\nOccasionally seen: entropion\nSuggested tests: hip\nLife span: 10-12 years","energy":"••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"•••","exercise":"••••","affection":"•••••","index":89,"url":"https://www.petfinder.com/dog-breeds/Komondor"}
{"malehw":"Ht: 28-30, Wt: 100-115","femalehw":"Ht: 26-28, Wt: 70-90","catfriendly":"•••••","easytraining":"••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••••","temperament":"Despite his sweet looks, the kuvasz is a tough protector, fearlessly defending his family or home. He is gentle with and protective of children in his own family. He is reserved with strangers; however, he tends to be very gentle with other pets and livestock. He is devoted and loyal but not very demonstrative. Some can be domineering.","care":"The kuvasz needs daily exercise and enjoys a long walk or good run in a safe area. He does best when allowed access to both house and yard. His coat needs brushing one or two times weekly, more often during heavy shedding periods.","breed":"Kuvasz","health":"Major concerns: CHD, OCD\nMinor concerns: none\nOccasionally seen: panosteitis, HOD\nSuggested tests: hip\nLife span: 9-12 years","energy":"••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"•••","exercise":"•••••","affection":"••","index":90,"url":"https://www.petfinder.com/dog-breeds/Kuvasz"}
{"malehw":"Ht: 22.5-24.5, Wt: 65-80","femalehw":"Ht: 21.5-23.5, Wt: 55-70","catfriendly":"••••••","easytraining":"••••••","watchdog":"•••••","grooming":"•••","coldtolerant":"•••••","care":"Few breeds so richly deserve their popularity as the Labrador retriever. Devoted, obedient and amiable, the Lab is good with children, other dogs and other pets. He will be a calm house dog, playful yard dog and intense field dog, all on the same day. He is eager to please, enjoys learning and excels in obedience. He is a powerful breed that loves to swim and retrieve. He needs daily physical and mental challenges to keep him occupied, however; a bored Lab can get into trouble.","breed":"Labrador Retriever","health":"Labradors are active and sociable dogs. They need daily exercise, preferably in the form of retrieving and swimming. Labrador parents with swimming pools either must fence them out or be prepared to share the pool with dog. The Lab coat sheds water easily and needs weekly brushing to remove dead hair. Labs are much happier indoors with their family.","energy":"•••••","playfulness":"••••••","dogfriendly":"•••••","strangerfriendly":"••••••","protection":"•••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":91,"url":"https://www.petfinder.com/dog-breeds/Labrador-Retriever"}
{"malehw":"Ht: 14.5, Wt: 17","femalehw":"Ht: 13.5, Wt: 17","catfriendly":"••","easytraining":"••","watchdog":"••••••","grooming":"•••••","coldtolerant":"••••","temperament":"The spunky Lakeland makes the most of every day, always busy investigating, playing, hunting, running and chasing. Given daily exercise in a safe area, he settles down in the home and makes an entertaining and endearing friend. Clever, independent and stubborn, he can be mischievous. He is nonetheless sensitive and must be trained with patience as well as a sense of humor.","care":"This is an active breed that needs daily entertainment or he will make it for himself. A moderate walk on leash or a hardy game in the yard can usually satisfy his needs, but he also enjoys the chance to explore off leash in a safe area. His wire coat needs combing one or two times weekly, plus scissoring and shaping four times yearly.","breed":"Lakeland Terrier","health":"Major concerns: none\nMinor concerns: lens luxation, distichiasis\nOccasionally seen: Legg-Perthes, vWD\nSuggested tests: eye\nLife span: 12-16 years","energy":"•••••","playfulness":"••••••","dogfriendly":"••","strangerfriendly":"••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":92,"url":"https://www.petfinder.com/dog-breeds/Lakeland-Terrier"}
{"malehw":"Ht: 10-11, Wt: 13-15","femalehw":"Ht: 10-11, Wt: 13-15","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"•••••","coldtolerant":"••••","care":"Despite his lap-dog appearance, the Lhasa is a tough character. He is independent, stubborn and bold. Although he is eager for a romp or game, he will be happy as long as he is given exercise. He will also happily snooze beside his owner. These characteristics make him an excellent small companion in adventure. He is somewhat reserved with strangers.","breed":"Lhasa Apso","health":"The Lhasa is an active dog, but his relatively small size makes it possible to meet his energy needs either with short walks or vigorous play sessions in the yard, or even home. The Lhasa makes a fine apartment dog. He is not suited for outdoor living. The long coat needs brushing and combing every other day.","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"•••","exercise":"••","affection":"••••","index":93,"url":"https://www.petfinder.com/dog-breeds/Lhasa-Apso"}
{"malehw":"Ht: 12-14, Wt: 8-18","femalehw":"Ht: 12-14, Wt: 8-18","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"•••••","coldtolerant":"••••","temperament":"This is a lively, inquisitive, affectionate dog. He is a mixture of playful spirit and calm soul mate, a good companion for a quiet family. He is willing to please and responsive to commands, and is devoted to his family. Some may bark or dig a lot.","care":"The Lowchen can receive ample exercise with a short walk or active game every day. He enjoys a mental challenge. He is not a breed that should live outside, although he appreciates access to a yard during the day. His coat needs brushing or combing about every other day. Clipping to maintain the traditional lion trim must be done every month or two. Many pet owners prefer to keep their dogs in a puppy clip.","breed":"Lowchen","health":"Major concerns: none\nMinor concerns: patellar luxation\nOccasionally seen: none\nSuggested tests: none\nLife span: 13-15 years","energy":"••••","playfulness":"••••","dogfriendly":"•••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••","affection":"••••","index":94,"url":"https://www.petfinder.com/dog-breeds/Lowchen"}
{"malehw":"Ht: 9-10, Wt: 4-7","femalehw":"Ht: 9-10, Wt: 4-7","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","care":"Long a favorite lap dog, the gentle Maltese fills this role admirably. She also has a wild side and loves to run and play. Despite her innocent look, she is bold and feisty and may challenge larger dogs. She can be reserved with strangers. Some bark a lot.","breed":"Maltese","health":"The exercise requirements of the Maltese are easily met with indoor games, a romp in the yard or a short walk on leash. Despite her coat, the Maltese is not an outdoor dog. The coat needs combing every one or two days. The white coat may be difficult to keep clean in some areas. Pets may be clipped for easier care.","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"•••","exercise":"••","affection":"••••","index":95,"url":"https://www.petfinder.com/dog-breeds/Maltese"}
{"malehw":"Ht: 15-16, Wt: 12-22","femalehw":"Ht: 15-16, Wt: 12-22","catfriendly":"••","easytraining":"•••","watchdog":"••••••","grooming":"••","coldtolerant":"••","temperament":"The Manchester terrier has been described as \"catlike,\" being impeccably clean, independent, reserved with strangers, yet sensitive. She is more responsive than many terriers and is generally a well-mannered house dog. She is devoted to her family, and enjoys napping at her special person's side. Otherwise, she is busy, ever nosing around for adventure or a game. Some tend to dig.","care":"This alert and active breed can have her exercise needs met with a moderate walk on leash, good romp in the yard or an off-lead foray in a safe area. This is not a breed that should live outdoors, although she appreciates access to a yard during the day. She likes a warm, soft bed. Coat care is minimal.","breed":"Manchester Terrier (Standard)","health":"Major concerns: lens luxation\nMinor concerns: none\nOccasionally seen: epilepsy, skin fragility\nSuggested tests: eye\nLife span: 15-16 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"•••••","exercise":"••••","affection":"••••","index":96,"url":"https://www.petfinder.com/dog-breeds/Manchester-Terrier-(Standard)"}
{"malehw":"Ht: 10-12, Wt: <12 (6-8)","femalehw":"Ht: 10-12, Wt: <12 (6-8)","catfriendly":"•••","easytraining":"••","watchdog":"••••••","grooming":"••","coldtolerant":"••","temperament":"Although true to his terrier heritage when it comes to hunting instincts, the toy Manchester is among the gentlest and most sensitive of breeds. He is playful with his family, yet reserved, sometimes even timid, with strangers. The toy Manchester terrier is inquisitive and may chase small pets.","care":"This is not an outdoor breed. He enjoys a romp outdoors, but he hates the cold. Indoors, he appreciates a soft, warm bed. Coat care is minimal, consisting of occasional brushing to remove dead hair.","breed":"Manchester Terrier (Toy)","health":"Major concerns: none\nMinor concerns: lens luxation, Legg Perthes, vWD\nOccasionally seen: epilepsy\nSuggested tests: eye, DNA for vWD\nLife span: 14-16 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••","strangerfriendly":"••","protection":"••","heattolerant":"•••••","exercise":"••","affection":"•••","index":97,"url":"https://www.petfinder.com/dog-breeds/Manchester-Terrier-(Toy)"}
{"malehw":"Ht: 30, Wt: 175-190","femalehw":"Ht: 27.5, Wt: 175-190","catfriendly":"•••••","easytraining":"••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"The mastiff is innately good-natured, calm, easygoing and surprisingly gentle. He is a well-mannered house pet, but needs sufficient room to stretch out. This is an extremely loyal breed, and though not excessively demonstrative, he is devoted to his family and good with children.","care":"The adult mastiff needs daily moderate exercise, consisting of either a good walk or game. He does not enjoy hot weather; in fact he is a breed that should live inside with his family so that he will be inclined to fulfill his role of devoted guardian. He tends to drool. Coat care is minimal.","breed":"Mastiff","health":"Major concerns: CHD, gastric torsion\nMinor concerns: ectropion, PPM, vaginal hyperplasia, elbow dysplasia, PRA\nOccasionally seen: cardiomyopathy\nSuggested tests: hip, elbow, eye\nLife span: 8-10 years\nNote: Obesity can be a problem.","energy":"••","playfulness":"••","dogfriendly":"••••","strangerfriendly":"•••","protection":"•••••","heattolerant":"•••","exercise":"•••","affection":"•••••","index":98,"url":"https://www.petfinder.com/dog-breeds/Mastiff"}
{"malehw":"Ht: 10-14, Wt: 25-33","femalehw":"Ht: 10-14, Wt: 25-33","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"Very much like the larger bull terrier, the mini is comical, lively, playful and mischievous. Despite her smaller size, she is not a lap dog. She is every bit as tough as the larger version and apt to want to prove herself even more. She is a sweet clown, devoted but not fawning. She is stubborn and independent and needs to be trained with a firm yet gentle hand , and a good sense of humor. She likes to play and investigate. She likes to dig, and needs ample exercise.","care":"The mini's exercise needs are daily, but not excessive. She needs either a moderate walk or a romp in a safe area. This is not a breed that should live outdoors, but she does do well with access to a yard. She can, however, do well as an apartment or city dog. Coat care is minimal.","breed":"Miniature Bull Terrier","health":"Major concerns: deafness (whites)\nMinor concerns: none\nOccasionally seen: patellar luxation, lens luxation\nSuggested tests: hearing (whites), (eye), (knee)\nLife span: 11-14 years","energy":"•••••","playfulness":"••••••","dogfriendly":"•••","strangerfriendly":"••••","protection":"••••","heattolerant":"••••","exercise":"••••","affection":"•••","index":99,"url":"https://www.petfinder.com/dog-breeds/Miniature-Bull-Terrier"}
{"malehw":"Ht: 10-12.5, Wt: 8-10","femalehw":"Ht: 10-12.5, Wt: 8-10","catfriendly":"••","easytraining":"••","watchdog":"••••••","grooming":"••","coldtolerant":"••","care":"Among the most energetic of all breeds, the min pin is a perpetual motion machine. He is busy, inquisitive, playful, bold and brash. He retains terrier-like traits and tends to be stubborn and independent. He may chase small animals and can be reserved with strangers.","breed":"Miniature Pinscher","health":"The min pin needs lots of activity. Because of his small size, his exercise needs can be met indoors or out; regardless, he needs several play sessions every day. He enjoys a romp outdoors in a safe area, but hates the cold. This is not a breed to live outdoors. His coat is virtually carefree, requiring only occasional brushing to remove dead hair.","energy":"••••••","playfulness":"••••••","dogfriendly":"•••","strangerfriendly":"••","protection":"••","heattolerant":"••••","exercise":"•••","affection":"•••","index":100,"url":"https://www.petfinder.com/dog-breeds/Miniature-Pinscher"}
{"malehw":"Ht: 12-14, Wt: 13-15","femalehw":"Ht: 12-14, Wt: 13-15","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"The miniature schnauzer deserves his place as one of the most popular terrier pets. He is playful, inquisitive, alert, spunky and companionable. He is a well-mannered house dog that also enjoys being in the middle of activities. He is less domineering than the larger schnauzers. He is also better with other animals than most terriers, although he will gladly give chase. He is clever and can be stubborn, but he is generally biddable. He enjoys children. Some may bark a lot.","care":"This energetic breed can have his exercise requirements met with a moderate walk on leash or a good game in the yard. He needs to share his life with his family inside the home. His wire coat needs combing once or twice weekly, plus scissoring and shaping every couple of months.","breed":"Miniature Schnauzer","health":"Major concerns: urolithiasis, PRA\nMinor concerns: follicular dermatitis, esophageal achalasia, vWD\nOccasionally seen: pulmonic stenosis, Legg-Perthes, cataract\nSuggested tests: eye, DNA test for vWD, (cardiac)\nLife span: 12-14 years","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":101,"url":"https://www.petfinder.com/dog-breeds/Miniature-Schnauzer"}
{"malehw":"Ht: 28, Wt: 130-150","femalehw":"Ht: 26, Wt: 100-120","catfriendly":"••••••","easytraining":"••••","watchdog":"••••","grooming":"••••","coldtolerant":"••••••","care":"The most important single characteristic of the Newfoundland is sweetness of temperament. The Newfoundland is calm, patient, easygoing, gentle and amiable, a friend to all. If her family is threatened, however, the Newfoundland can act protectively.","breed":"Newfoundland","health":"This easygoing dog needs daily exercise to stay fit, either in the form of a moderate walk or short romp. She loves to swim and pull, especially in Fcold weather. Some breeders contend that Landseers tend to be more active and need more exercise than solids. She does not do well in hot weather and should not be kept outside. She is best when allowed access to both house and yard, but needs lots of room inside to stretch out. Her coat needs combing twice weekly, more frequently when shedding. Newfs do drool and also tend to be messy drinkers.","energy":"•••","playfulness":"••••","dogfriendly":"•••••","strangerfriendly":"••••••","protection":"•••••","heattolerant":"••","exercise":"•••","affection":"••••••","index":102,"url":"https://www.petfinder.com/dog-breeds/Newfoundland"}
{"malehw":"Ht: 9-10, Wt: 11-12","femalehw":"Ht: 9-10, Wt: 11-12","catfriendly":"••••","easytraining":"•••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"Feisty, bold, inquisitive, game, scrappy, stubborn and independent, the Norfolk is all terrier. She has been called a \"demon\" in the field, and she loves to hunt, dig and investigate. She must be exercised in a safe area. SHe is clever and amiable but strong-willed.","care":"The Norfolk terrier needs an exercise outing every day, either a short to moderate walk or a lively and boisterous play session. She especially likes to hunt and investigate, but she must do so in a safe area. She is such a family-oriented dog that she is emotionally unsuited for outdoor living. She does best as a house dog with access to a yard. Her wire coat needs combing once or twice weekly, plus stripping of dead hairs three to four times yearly.","breed":"Norfolk Terrier","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: cardiomyopathy, patellar luxation\nSuggested tests: (cardiac), (knee)\nLife span: 13-15 years","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••","index":103,"url":"https://www.petfinder.com/dog-breeds/Norfolk-Terrier"}
{"malehw":"Ht: 20.5, Wt: 55","femalehw":"Ht: 19.5, Wt: 48","catfriendly":"•••","easytraining":"••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••••","temperament":"The Norwegian Elkhound combines traits of hounds and Spitz-like dogs, resulting in a breed that is bold, playful, independent, alert, boisterous and, unlike most hounds, even protective. This is a dog ready for adventure! He needs daily exercise, lest he become frustrated or even destructive. He is friendly with strangers. He may bark a lot.","care":"The Elkhound was developed to hunt all day under grueling conditions. He needs daily exertion in order to feel satisfied. This can be in the form of a good jog, very long walk or invigorating play session. He is happiest living with his family. His double coat needs brushing twice a week and daily during main shedding season when he sheds a lot.","breed":"Norwegian Elkhound","health":"Major concerns: CHD\nMinor concerns: pyotraumatic dermatitis, PRA\nOccasionally seen: Fanconi syndrome\nSuggested tests: hip, eye\nLife span: 10-12 years","energy":"•••••","playfulness":"•••••","dogfriendly":"•••","strangerfriendly":"••••","protection":"•••••","heattolerant":"••","exercise":"••••","affection":"••••","index":104,"url":"https://www.petfinder.com/dog-breeds/Norwegian-Elkhound"}
{"malehw":"Ht: 10, Wt: 12","femalehw":"Ht: 10, Wt: 12","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"The Norwich terrier, like the Norfolk, is a true terrier at heart, always ready for adventure and excitement. He is a hunter and may chase small animals. He is a pert, independent, amusing — but sometimes challenging — companion, best suited for people with a sense of adventure and humor.","care":"The Norwich needs to stretch his legs with a good walk or short run every day. He especially likes combining a run with a chance to explore, but any such off-leash expeditions must be done only in a safe area. He is better suited as a house dog with yard access. His wiry coat needs combing one to two times weekly, plus stripping of dead hairs three to four times a year.","breed":"Norwich Terrier","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: cardiomyopathy, patellar luxation\nSuggested tests: (cardiac), (knee)\nLife span: 13-15 years","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":105,"url":"https://www.petfinder.com/dog-breeds/Norwich-Terrier"}
{"malehw":"Ht: 22+, Wt: 70-90","femalehw":"Ht: 21+, Wt: 60-80","catfriendly":"••••••","easytraining":"••","watchdog":"••••","grooming":"•••••","coldtolerant":"•••••","care":"The amiable Old English is jolly but gentle. At home, he is a well-mannered house pet that often amuses his family with comical antics. He thrives on human companionship and is very much a homebody. He is extremely devoted to its family and protective of family members, tending children as flock members. He is friendly toward strangers. Some can be headstrong.","breed":"Old English Sheepdog","health":"The Old English Sheepdog needs daily exercise, either a moderate to long walk or a vigorous romp. This breed thrives on togetherness so it is necessary that he have access to the house. His coat needs brushing or combing every other day, or he may form mats. He may tend to track in debris.","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••••","heattolerant":"•••","exercise":"••••","affection":"••••••","index":106,"url":"https://www.petfinder.com/dog-breeds/Old-English-Sheepdog"}
{"malehw":"Ht: 27, Wt: 115","femalehw":"Ht: 24, Wt: 80","catfriendly":"••••","easytraining":"•••","watchdog":"•••••","grooming":"••••","coldtolerant":"•••••","temperament":"As a pack hound, the Otterhound is amiable with other dogs. As a hunter, he has an innate urge to follow the trails of mammals. Once on the trail, he is determined, single-minded and nearly impossible to dissuade from his task. Even though the Otterhound's job was not to kill his quarry, he will nonetheless give chase to small animals. The Otterhound loves to hunt, sniff, trail and, especially, swim. At home he is boisterous, amiable and easygoing (although stubborn), affectionate with his family, and quite good with children. Because the Otterhound was never traditionally kept as a pet, he is not among the most responsive of breeds. However, the Otterhound is a low-key dog that can function as a quiet companion.","care":"The Otterhound needs daily exercise in a safe area or on a leash. He has a loud, melodious voice that carries for long distances. The Otterhound's coat requires only weekly brushing or combing. He may need his beard washed more frequently. Tidiness is not one of his virtues; the large, hairy feet tend to hold debris and mud, and the long hair around the mouth can hold water and food.","breed":"Otterhound","health":"Major concerns: CHD, CTP, gastric torsion\nMinor concerns: elbow dysplasia\nOccasionally seen: none\nSuggested tests: hip, elbow, blood\nLife span: 10-13 years","energy":"•••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••••","protection":"••","heattolerant":"•••","exercise":"••••","affection":"••••••","index":107,"url":"https://www.petfinder.com/dog-breeds/Otterhound"}
{"malehw":"Ht: 8-11, Wt: 9-10","femalehw":"Ht: 8-11, Wt: 9-10","catfriendly":"•••••","easytraining":"••••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••","temperament":"One of the most obedient and responsive of the toy breeds, the vivacious papillon is also gentle, amiable and playful. He is friendly toward strangers, other dogs and pets and is very good with children. Some can be timid.","care":"The lively papillon thrives on mental stimulation, and he enjoys a daily walk on leash as well as challenging games indoors or out. This is not a breed that can live outdoors. His coat needs brushing twice weekly.","breed":"Papillon","health":"Major concerns: none\nMinor concerns: PRA, patellar luxation\nOccasionally seen: none\nSuggested tests: knee, eye\nLife span: 12-15 years","energy":"•••••","playfulness":"••••••","dogfriendly":"•••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••","affection":"••••••","index":108,"url":"https://www.petfinder.com/dog-breeds/Papillon"}
{"malehw":"Ht: 6-9, Wt: <14","femalehw":"Ht: 6-9, Wt: <14","catfriendly":"•••••","easytraining":"••","watchdog":"••••••","grooming":"••••••","coldtolerant":"••••","care":"The Pekingese is decidedly not a sissy lap dog. She is a courageous character that will not start a fight but will not back down from one either. She tends to be aloof around strangers. She is extremely devoted to her family, but is independent and not overly demonstrative. Her stubbornness is legendary. Although playful around family members.","breed":"Pekingese","health":"The Pekingese enjoys a leisurely walk outdoors, but she is equally happy to romp inside. She can easily die of heat prostration. She must be kept in air conditioning in warm weather. She is an ideal apartment dog. The coat will mat unless combed at the very least weekly, preferably more often. The over-nose wrinkle should be cleaned daily to avoid infection. The coat around the anus must be inspected daily for soiling. Pekingese tend to snore!","energy":"••","playfulness":"••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"••","exercise":"••","affection":"••","index":109,"url":"https://www.petfinder.com/dog-breeds/Pekingese"}
{"malehw":"Ht: 10-12, Wt: 27","femalehw":"Ht: 10-12, Wt: 25","catfriendly":"•••••","easytraining":"•••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","care":"Quick and quick-witted, the Pembroke Welsh Corgi has an active mind and body. He needs daily physical and mental exercise to be at his best in the house. He is devoted and willing to please, fun-loving, amiable and companionable. He is very good with children and can be reserved with strangers. Many bark a lot.","breed":"Pembroke Welsh Corgi","health":"The Pembroke loves to herd, he can do fine without herding, however. As long as he gets a moderate walk on leash or a good play and training session off leash in a safe area. He is physically able to live outdoors in temperate climates, but he is mentally far better suited to share his family's home and have access to a yard. Coat care consists only of brushing once a week to remove dead hairs.","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"•••••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":110,"url":"https://www.petfinder.com/dog-breeds/Pembroke-Welsh-Corgi"}
{"malehw":"Ht: 13-15, Wt: 25-35","femalehw":"Ht: 13-15, Wt: 25-35","catfriendly":"••••","easytraining":"••","watchdog":"•••••","grooming":"•••","coldtolerant":"••••","temperament":"Despite his appearance, the PBGV is not a Basset Hound in a wire coat, but in many ways is more terrier-like in temperament. He is a merry, inquisitive, tough, busy dog, always on the lookout for excitement and fun. He loves to sniff, explore, trail and dig , a true hunter at heart. Amiable and playful, he is good with children, other dogs and pets, and he is friendly toward strangers. The PBGV is stubborn and independent. He tends to dig and bark.","care":"The PBGV is not content to lie around. His exercise requirements can be easily fulfilled, however, by a good walk on leash or a vigorous romp in the yard. He is happiest when dividing his time between house and yard. The coat needs weekly brushing and occasional tidying of straggling hairs.","breed":"Petit Basset Griffon Vendeen","health":"Major concerns: none\nMinor concerns: otitis externa, CHD\nOccasionally seen: meningitis, patellar luxation, epilepsy\nSuggested tests: (hip)\nLife span: 11-14 years","energy":"•••••","playfulness":"•••••","dogfriendly":"•••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":111,"url":"https://www.petfinder.com/dog-breeds/Petit-Basset-Griffon-Vendeen"}
{"malehw":"Ht: 23-25, Wt: 45-55","femalehw":"Ht: 21-24, Wt: 45-55","catfriendly":"•••","easytraining":"••••","watchdog":"•••••","grooming":"••","coldtolerant":"•••","temperament":"The svelte Pharaoh Hound is more than a gracious addition to the home (though he surely is that) he is a keen hunter and an exuberant chaser. Although he is calm indoors, he loves to run. He is sensitive, loving, gentle and good with children and other dogs. He tends to be reserved with strangers; some pharaoh hounds are even timid. He is independent but willing to please. The breed has the unique characteristic of \"blushing\" when excited, with the nose and ears turning a rosy color.","care":"The Pharaoh Hound relishes the opportunity to stretch his legs in a safe area, although he can manage with long daily walks on leash and occasional sprints. He needs soft bedding and warmth and generally should not be expected to sleep outside. His coat is low maintenance, requiring only occasional brushing to remove dead hair.","breed":"Pharaoh Hound","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: none\nSuggested tests: none\nLife span: 11-14 years","energy":"••••","playfulness":"••••","dogfriendly":"•••••","strangerfriendly":"•••","protection":"••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":112,"url":"https://www.petfinder.com/dog-breeds/Pharaoh-Hound"}
{"malehw":"Ht: 25-28, Wt: 55-75","femalehw":"Ht: 23-26, Wt: 45-65","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••","coldtolerant":"••••","temperament":"The pointer is a true wide-ranging hunter, which means that he not only is an excellent bird dog but also has the stamina to run for hours. Consequently, he needs lots of exercise or he can become frustrated and destructive. Because he is ever on the lookout for birds, he is easily distracted from everyday matters, but he is nearly impossible to distract once on point. He is gentle and sweet but also can be energetic and boisterous at times. Like many sporting breeds, he can be found in field or show types; the field type is generally smaller and perhaps more active.","care":"The pointer needs exercise, and lots of it. He needs at least an hour of exertion every day. He enjoys running and searching the wilds on long jaunts afield. At home he needs space to exercise outdoors and should not be expected to sit inside all day. The pointer needs canine or human companionship and does far better when allowed to spend time with his family. He requires only an occasional brushing to remove dead hair.","breed":"Pointer","health":"Major concerns: entropion\nMinor concerns: CHD\nOccasionally seen: cataract, deafness\nSuggested tests: (hip), eye\nLife span: 12-15 years\nNote: prone to tail-tip injuries","energy":"•••••","playfulness":"•••••","dogfriendly":"•••••","strangerfriendly":"••••","protection":"••••","heattolerant":"••••","exercise":"•••••","affection":"•••••","index":113,"url":"https://www.petfinder.com/dog-breeds/Pointer"}
{"malehw":"Ht: 8-11, Wt: 3-7","femalehw":"Ht: 8-11, Wt: 3-7","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","care":"Bouncy, bold and busy, the Pomeranian makes the most of every day. He is curious, playful, self-confident (even cocky) and attentive, ever ready for a game or adventure. Some bark a lot.","breed":"Pomeranian","health":"The Pomeranian is active but diminutive, needing daily exercise but able to meet his needs with indoor games or short walks. Although he has a warm coat, he is too small and too family-oriented to live as an outdoor dog. His double coat needs brushing twice weekly, more when shedding.","energy":"•••••","playfulness":"•••••","dogfriendly":"••","strangerfriendly":"••","protection":"••","heattolerant":"••••","exercise":"••","affection":"••","index":114,"url":"https://www.petfinder.com/dog-breeds/Pomeranian"}
{"malehw":"Ht: 10-15, Wt: 12-18","femalehw":"Ht: 10-15, Wt: 12-18","catfriendly":"••••","easytraining":"••••••","watchdog":"••••••","grooming":"••••••","coldtolerant":"••••","temperament":"The miniature Poodle is lively, amiable, playful, eager to please, responsive, smart and obedient, small wonder that he has remained one of the most popular varieties of dog for so long. He is sensitive, tending to be devoted to one person, and initially reserved with strangers. He is good with children, other pets and dogs. Some tend to bark a lot.","care":"All Poodles need a lot of interaction with people. They also need mental and physical exercise. A brief but challenging obedience or play session, combined with a walk, should be part of every Poodle's day. Standard Poodles will need more exercise and may especially enjoy swimming. No Poodle should live outdoors. The show poodle should preferably be brushed every day or weekly for shorter coats. Poodle hair, when shed, does not fall out but becomes caught in the surrounding hair, which can cause matting if not removed. The pet clips are easier to maintain and can be done every four to six weeks.","breed":"Poodle (Miniature)","health":"Major concerns: Pra, Legg - Perthes, patellar luxation, epilepsy\nMinor concerns: trichiasis, entropion, lacrimal duct atresia, \ncataract, glaucoma, distichiasis\nOccasionally seen: urolithiasis, intervertebral disc degeneration\nSuggested tests: eye, knee, hip\nLife span: 13-15 years","energy":"•••••","playfulness":"••••••","dogfriendly":"•••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":115,"url":"https://www.petfinder.com/dog-breeds/Poodle-(Miniature)"}
{"malehw":"Ht: 15-21, Wt: 45-65","femalehw":"Ht: 15-21, Wt: 45-65","catfriendly":"•••••","easytraining":"••••••","watchdog":"••••••","grooming":"••••••","coldtolerant":"••••","care":"Among the very smartest and most obedient of dogs, the standard Poodle combines playful exuberance with a zest for life's adventures. He retains his hunting heritage and loves to run, swim and retrieve. He gets along well with everyone, although he can be somewhat reserved with strangers. He is excellent with children.","breed":"Poodle (Standard)","health":"All Poodles need a lot of interaction with people. They also need mental and physical exercise. A brief but challenging obedience or play session, combined with a walk, should be part of every Poodle's day. Standard Poodles will need more exercise and may especially enjoy swimming. No Poodle should live outdoors. The show Poodle should preferably be brushed every day or weekly for shorter coats. Poodle hair, when shed, does not fall out but becomes caught in the surrounding hair, which can cause matting if not removed. The pet clips are easier to maintain and can be done every four to six weeks.","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"•••••","heattolerant":"••••","exercise":"•••••","affection":"••••","index":116,"url":"https://www.petfinder.com/dog-breeds/Poodle-(Standard)"}
{"malehw":"Ht: <10, Wt: 4-8","femalehw":"Ht: <10, Wt: 4-8","catfriendly":"••••","easytraining":"••••••","watchdog":"••••••","grooming":"••••••","coldtolerant":"•••","temperament":"The pert and peppy toy poodle is one of the brightest and easiest breeds to train. She is alert, responsive, playful, lively, sensitive and eager to please. She is devoted to her family. Some can be reserved with strangers; others may bark a lot.","care":"Poodles need a lot of interaction with people. They also need mental and physical exercise. The toy poodle's exercise needs can be met with a short walk or even indoor games. This is not a breed that should ever live outside, although she enjoys access to a yard. Her coat should be brushed every day or two. Poodle hair, when shed, does not fall out but becomes caught in the surrounding hair, which can cause matting if not removed. Clipping should be done at least four times a year, with the face and feet clipped monthly. Although most poodles are professionally groomed, poodle parents can learn to groom their own dog.","breed":"Poodle (Toy)","health":"Major concerns: PRA, patellar luxation, Legg - Perthes, epilepsy\nMinor concerns: trichiasis, entropion, lacrimal duct atresia, cataracts\nOccasionally seen: urolithiasis, intervertebral disc degeneration\nSuggested tests: eye, knee, hip\nLife span: 12-14 years","energy":"•••••","playfulness":"••••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"•••","affection":"•••••","index":117,"url":"https://www.petfinder.com/dog-breeds/Poodle-(Toy)"}
{"malehw":"Ht: 20-23, Wt: 42-60","femalehw":"Ht: 17-21, Wt: 35-50","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••••••","coldtolerant":"••••","care":"The gregarious Portuguese water dog is a fun-loving, family-loving, water-loving dog. He is good with children, and other dogs and pets. He is sensitive and responds well to direction. He is a good breed for an active person wanting an adventurous, affectionate, biddable partner.","breed":"Portuguese Water Dog","health":"This active breed needs daily physical and mental exercise, preferably involving swimming and retrieving. Otherwise, he needs a long walk or jog or a vigorous romp. He is happiest living close to his family. His coat needs combing every other day, plus monthly clipping or scissoring.","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••••","heattolerant":"••••","exercise":"•••••","affection":"•••••","index":118,"url":"https://www.petfinder.com/dog-breeds/Portuguese-Water-Dog"}
{"malehw":"Ht: 10-11, Wt: 14-18","femalehw":"Ht: 10-11, Wt: 14-18","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"•••","coldtolerant":"••••","care":"A delightful blend of dignity and comedy, the pug is an amiable, playful and confident companion. He can be stubborn and headstrong, but he is pleasant and generally willing to please. He loves to cavort and show off.","breed":"Pug","health":"The pug needs daily exercise, either in the form of a lively game or a moderate walk on leash. He does not do well in heat and humidity and should not be kept outdoors. He needs minimal coat care but daily cleaning of facial wrinkles. His smooth coat needs only occasional brushing to remove dead hairs; however, the wrinkles need regular cleaning and drying to prevent skin infections. The pug wheezes and snores.","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••","heattolerant":"••","exercise":"•••","affection":"•••••","index":119,"url":"https://www.petfinder.com/dog-breeds/Pug"}
{"malehw":"Ht: 17, Wt: 25-35","femalehw":"Ht: 16, Wt: 25-35","catfriendly":"••••","easytraining":"•••","watchdog":"••••••","grooming":"••••••","coldtolerant":"•••••","care":"A mop on springs, the Puli is full of bouncing energy. He is busy and curious and needs daily exercise. This smart dog is also headstrong and tough. Alert and watchful, he is also protective of his family. He barks a lot.","breed":"Puli","health":"This is an energetic breed on the lookout for a job. He can be satisfied with a good walk or jog, or a lively game and training session, however. He makes an excellent house dog. His coat can hold debris. His nonshedding coat can be brushed or corded; if brushed, He needs brushing every one to two days. If corded, the cords must be regularly separated because the coat tends to hold dirt; bathing is time consuming and drying takes as much as one day. Pets can be clipped, but then part of the breed's unique appeal is lost.","energy":"•••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"•••","exercise":"••••","affection":"•••","index":120,"url":"https://www.petfinder.com/dog-breeds/Puli"}
{"malehw":"Ht: 25-27, Wt: 85","femalehw":"Ht: 24-26, Wt: 70","catfriendly":"•••","easytraining":"••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","care":"The Rhodesian Ridgeback is the hound group's answer to a somewhat protective dog. Not only is he a keen and versatile hunter, but he is a loyal guardian. He is good with children, especially protective of those in his family, but he is sometimes overly boisterous in play. He is strong-willed and powerful; some can become domineering.","breed":"Rhodesian Ridgeback","health":"The Ridgeback loves to run, and he needs daily mental and physical exercise to keep from becoming frustrated. He can be a good jogging or hiking companion. The Ridgeback is happier sleeping indoors and dividing his time between the house and yard during the day. Coat care is minimal, consisting only of occasional brushing to remove dead hair.","energy":"••••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"••••","exercise":"••••","affection":"••••","index":121,"url":"https://www.petfinder.com/dog-breeds/Rhodesian-Ridgeback"}
{"malehw":"Ht: 24-27, Wt: 85-135","femalehw":"Ht: 22-25, Wt: 80-100","catfriendly":"•••","easytraining":"••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"Confident, bold, alert and imposing, the Rottweiler is a popular choice for his ability to protect. As befitting his self-assured nature, he tends to be headstrong and stubborn and is often domineering. He can be reserved, often wary, toward strangers. He may be overly protective if he perceives that his family is being threatened, and he may also attempt to \"herd\" children. This is a powerful breed that needs socialization, consistent training and daily exercise to be the best he can be , a loyal family member and guardian.","care":"The Rottweiler needs daily physical and mental activity, either in the form of long walks or jogs, or a vigorous game in a safe area, as well as obedience lessons. He enjoys cold weather and may become overheated in hot weather. He needs to spend significant time inside with his human family, however, so that proper bonding can occur. Coat care is minimal, consisting only of occasional brushing to remove dead hair.","breed":"Rottweiler","health":"Major concerns: CHD, elbow dysplasia, SAS, osteosarcoma, gastric torsion\nMinor concerns: OCD, entropion, ectropion, vWD, panosteitis\nOccasionally seen: PRA, cataract, epilepsy\nSuggested tests: hip, elbow, cardiac, blood, (eye)\nLife span: 8-11 years","energy":"••••","playfulness":"•••","dogfriendly":"••","strangerfriendly":"••","protection":"••••••","heattolerant":"•••","exercise":"••••","affection":"•••","index":122,"url":"https://www.petfinder.com/dog-breeds/Rottweiler"}
{"malehw":"Ht: >27.5, Wt: 120-200","femalehw":"Ht: >25, Wt: 120-200","catfriendly":"•••••","easytraining":"••••","watchdog":"•••","grooming":"•••","coldtolerant":"••••••","care":"The calm, easygoing Saint Bernard is gentle and patient around children, although he is not particularly playful. He is devoted to his family and is willing to please, although at his own pace. He can be stubborn.","breed":"Saint Bernard","health":"The Saint Bernard needs daily exercise in order to stay fit. His requirements can be met with moderate walks and short runs, however. Overweight puppies are more prone to hip probleearms. He enjoys cold weather and does not do well in heat. This breed does best when allowed access to both house and yard. His coat, whether long or short, needs weekly brushing, more so when shedding. All Saints drool.","energy":"•••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••","exercise":"•••","affection":"•••••","index":123,"url":"https://www.petfinder.com/dog-breeds/Saint-Bernard"}
{"malehw":"Ht: 23-28, Wt: 35-65","femalehw":"Ht: 23-28, Wt: 35-65","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"••","coldtolerant":"•••","temperament":"The Saluki tends to be aloof and reserved with strangers. He is extremely devoted to his own family, but is not particularly demonstrative. The Saluki is very gentle with children. Extremely sensitive, he does not take to rough-and-tumble play or deal well with harsh corrections. Some Salukis can be shy. This breed is very quiet and sedate indoors, seeking out a soft, warm spot. Outside, he runs in great circles at tremendous speeds and will chase any small running animals or fast-moving objects. The Saluki may not come when called.","care":"Daily exercise is essential, preferably in the form of free running in a safe, enclosed area. The Saluki's needs can also be met with long leash walks or jogging. Salukis should sleep inside and they do best as indoor dogs with access to a yard. They can play in snow and cold weather but should not be expected to spend extended time in the cold. The Saluki must have a soft bed, or he could develop callouses. A Saluki in proper weight is naturally thin; however, this breed tends to be a picky eater, which can result in a very thin-looking dog. Many people not familiar with the Saluki wrongly assume that the dog is not being fed properly! The smooth coat needs only occasional brushing to remove dead hair, but the feathered coat needs combing once or twice a week to prevent matting.","breed":"Saluki (or Gazelle Hound)","health":"Major concerns: none\nMinor concerns: none\nOccasionally seen: cardiomyopathy\nSuggested tests: none\nLife span: 12-14 years\nNote: sensitive to anesthesia","energy":"•••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"•••","heattolerant":"••••","exercise":"••••","affection":"••••","index":124,"url":"https://www.petfinder.com/dog-breeds/Saluki-(or-Gazelle-Hound)"}
{"malehw":"Ht: 21-23.5, Wt: 45-65","femalehw":"Ht: 19-21, Wt: 35-50","catfriendly":"••••••","easytraining":"•••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••••","temperament":"Gentle and playful, the Samoyed makes a good companion for a child or person of any age. She is a closely bonded family dog. She is amiable with strangers, other pets and usually, other dogs. She is calm indoors, but this clever, sometimes mischievous breed needs daily physical and mental exercise. If allowed to become bored, she may dig and bark. She is independent and often stubborn, but is willing to please and is responsive to her family's wishes. She may tend to herd children.","care":"The Samoyed is active and needs a good workout every day, either in the form of a long walk or jog or a vigorous play session. She prefers to live indoors with her human family. Her thick coat needs brushing and combing two to three times a week, daily when shedding.","breed":"Samoyed","health":"Major concerns: CHD\nMinor concerns: gastric torsion\nOccasionally seen: PRA\nSuggested tests: hip, (eye)\nLife span: 10-12 years","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••","exercise":"••••","affection":"•••••","index":125,"url":"https://www.petfinder.com/dog-breeds/Samoyed"}
{"malehw":"Ht: 11-13, Wt: 12-16","femalehw":"Ht: 10-12, Wt: 12-16","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"•••","coldtolerant":"••••","temperament":"The Schipperke is a bold companion, even though it can be an independent and headstrong one. This little dynamo is happiest when busy, poking his nose into every cranny and ever on the lookout for adventure. He is reserved with strangers and an alert watchdog. He can make an amiable and pleasant house dog but needs daily exercise.","care":"The active nature of this breed makes exercise, both- mental and physical -imperative. His small stature makes getting that exercise fairly easy, however. Either a vigorous game in the yard or a moderate walk on leash will usually suffice to meets his needs. The Schipperke should not live outdoors. His double coat needs weekly brushing, more when shedding.","breed":"Schipperke","health":"Major concerns: none\nMinor concerns: Legg - Perthes\nOccasionally seen: entropion, distichiasis, PRA\nSuggested tests: none\nLife span: 13-15 years","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"•••••","heattolerant":"•••","exercise":"••••","affection":"•••","index":126,"url":"https://www.petfinder.com/dog-breeds/Schipperke"}
{"malehw":"Ht: 30-32, Wt: 85-110","femalehw":"Ht: >28, Wt: 75-95","catfriendly":"••••","easytraining":"•••","watchdog":"••","grooming":"••••","coldtolerant":"••••","temperament":"The Scottish Deerhound is mellow, low-key and easygoing, a gracious and well-mannered addition to the home. Outdoors, he loves to run and chase anything that moves. Indoors, he needs plenty of room to stretch on a soft surface. The Deerhound is independent but willing to please; he is extremely sensitive. The Deerhound is amiable toward, but often reserved with, strangers. This breed is good with children, other dogs and usually other pets, although he may give chase to strange animals.","care":"The Deerhound needs a good amount of daily exercise, either a long walk or a romp in a safe area. He prefers to live inside with his family and needs human companionship. Regardless, he needs soft bedding to avoid callouses. The crisp coat needs combing one or two times weekly. Some scissoring is optional to neaten up straggling hair, plus minimal stripping around the face and ears.","breed":"Scottish Deerhound","health":"Major concerns: gastric torsion, osteosarcoma\nMinor concerns: cardiomyopathy\nOccasionally seen: none\nSuggested tests: cardiac\nLife span: 8-11 years\nNote: sensitive to anesthesia","energy":"•••","playfulness":"•••","dogfriendly":"•••••","strangerfriendly":"••••","protection":"•••","heattolerant":"•••","exercise":"••••","affection":"••••","index":127,"url":"https://www.petfinder.com/dog-breeds/Scottish-Deerhound"}
{"malehw":"Ht: 10, Wt: 19-22","femalehw":"Ht: 10, Wt: 18-21","catfriendly":"••••","easytraining":"••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"Nicknamed the Diehard in reference to her rugged character, the Scottish terrier is a tough, determined character, ready for action. She is fearless and feisty. She is reserved, but friendly, with strangers, and devoted to her family. Although independent and stubborn, she is sensitive. She tends to dig and bark.","care":"This is a dog on the lookout for adventure, and she needs some excitement and exercise in her life every day. This can take the form of a moderate walk on leash, a boisterous game or an off-leash exploration in a safe area. She is best suited as a house dog with access to a yard. Her wire coat needs combing two to three times weekly, plus shaping every three months. Shaping for pets is by clipping.","breed":"Scottish Terrier","health":"Major concerns: vWD, CMO\nMinor concerns: Scotty cramp, intervertebral disc disease\nOccasionally seen: none\nSuggested tests: DNA for vWD\nLife span: 11-13 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"•••","heattolerant":"••","exercise":"••••","affection":"••••","index":128,"url":"https://www.petfinder.com/dog-breeds/Scottish-Terrier"}
{"malehw":"Ht: 10.5, Wt: 23-24","femalehw":"Ht: 10.5, Wt: 18-22","catfriendly":"••••","easytraining":"••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"One of the calmer terriers, the Sealyham is nonetheless ready for action, always happy to investigate, dig or give chase. She is a well-mannered house dog but needs some daily exercise. She can be reserved with strangers, but devoted to her family. She is stubborn and independent. Some dig and bark.","care":"The Sealyham's exercise needs are not too demanding, consisting of a short to moderate walk or game session every day. If allowed off leash, she should be in a safe area because she may tend to follow her nose. This breed is suited for indoor life, preferably with yard access, although she can live in an apartment. Her wire coat needs combing two to three times weekly, plus shaping every three months. Shaping for pets is by clipping, or stripping.","breed":"Sealyham Terrier","health":"Major concerns: none\nMinor concerns: retinal dysplasia, lens luxation\nOccasionally seen: deafness\nSuggested tests: eye\nLife span: 11-13 years","energy":"•••","playfulness":"•••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"•••","affection":"••••","index":129,"url":"https://www.petfinder.com/dog-breeds/Sealyham-Terrier"}
{"malehw":"Ht: 13-16, Wt: 20","femalehw":"Ht: 13-16, Wt: 20","catfriendly":"•••••","easytraining":"••••••","watchdog":"••••••","grooming":"•••••","coldtolerant":"••••","temperament":"The Shetland Sheepdog is extremely bright, sensitive and willing to please. This combination makes for a dog that is very obedient, quick to learn and utterly devoted to his family. He is not only gentle, playful, amiable and companionable, but also excellent with children, although he can nip at heels in play. He barks a lot.","care":"The Sheltie is energetic, but his exercise needs can be met with a good walk, short jog or active game and training session. He is too attached to his family to do well separated from them so the Sheltie should be a house dog. His thick coat needs brushing or combing every other day.","breed":"Shetland Sheepdog","health":"Major concerns: dermatomyositis\nMinor concerns: CEA, PRA, trichiasis, cataract, CHD, hemophilia, Legg - Perthes, patellar luxation\nOccasionally seen: PDA, deafness, epilepsy, vWD\nSuggested tests: eye, hip, DNA for vWD\nLife span: 12-14 years\nNote: may be sensitive to ivermectin. Merles should not be bred to merles because homozygous merle is lethal or detrimental to health.","energy":"••••","playfulness":"••••","dogfriendly":"•••••","strangerfriendly":"••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":130,"url":"https://www.petfinder.com/dog-breeds/Shetland-Sheepdog"}
{"malehw":"Ht: 14.5-16.5, Wt: 20-30","femalehw":"Ht: 13.5-15.5, Wt: 20-30","catfriendly":"•••","easytraining":"•••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••••","temperament":"Bold, independent and headstrong, the Shiba is brimming with self-confidence. He is lively outdoors, yet calm indoors, as long as he gets daily exercise. He may chase small animals. He is a hardy breed, ready for adventure. Some tend to be headstrong and domineering. He is territorial, alert and reserved with strangers, ingredients making for an excellent watchdog. He is quite vocal; some bark a lot.","care":"The Shiba needs a daily workout, either in the form of a vigorous game in the yard, a long walk or a good run in a safe area. He does best when allowed to divide his time between inside and out. His double coat needs brushing one or two times weekly, more when shedding.","breed":"Shiba Inu","health":"Major concerns: none\nMinor concerns: patellar luxation\nOccasionally seen: none\nSuggested tests: knee\nLife span: 12-15 years","energy":"••••","playfulness":"••••","dogfriendly":"•••","strangerfriendly":"••••","protection":"••••","heattolerant":"•••","exercise":"••••","affection":"••••","index":131,"url":"https://www.petfinder.com/dog-breeds/Shiba-Inu"}
{"malehw":"Ht: 8-11, Wt: 9-16","femalehw":"Ht: 8-11, Wt: 9-16","catfriendly":"•••••","easytraining":"•••","watchdog":"••••","grooming":"•••••","coldtolerant":"•••","care":"The spunky but sweet Shih Tzu is both a gentle lap dog and a vivacious companion. He has an upbeat attitude and loves to play and romp. He is affectionate to his family and good with children. He is surprisingly tough and does have a stubborn streak.","breed":"Shih Tzu","health":"Despite his small size, the Shih Tzu needs daily exercise. Because of his small size, he can meet his requirements with vigorous indoor games or short frolics outside or with short walks on leash. He does not do well in hot humid weather, and he should never be expected to live outdoors. His luxurious coat needs brushing or combing every other day; puppies should be taught to accept grooming from a young age. Pets may be clipped.","energy":"••••","playfulness":"•••••","dogfriendly":"•••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••","exercise":"••","affection":"•••••","index":132,"url":"https://www.petfinder.com/dog-breeds/Shih-Tzu"}
{"malehw":"Ht: 21-23.5, Wt: 45-60","femalehw":"Ht: 20-22, Wt: 35-50","catfriendly":"••••","easytraining":"••","watchdog":"••••","grooming":"••••","coldtolerant":"••••••","care":"Fun-loving, adventurous, alert, independent, clever, stubborn, mischievous and obstinate, all describe the Siberian husky. This breed loves to run and will roam if given the chance. He is generally good with other household dogs. In fact, he is a very social dog that must have human or canine companionship. He may chase strange cats or livestock. Some howl, dig and chew.","breed":"Siberian Husky","health":"This is an active dog, bred to run tirelessly for miles. He needs ample daily exercise, either in the form of a long jog or a long run off leash in a safe area. He also loves to pull and enjoys cold weather. His coat needs brushing one or \ntwo times a week, daily during periods of heaviest shedding.","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••••","protection":"••","heattolerant":"••","exercise":"•••••","affection":"•••••","index":133,"url":"https://www.petfinder.com/dog-breeds/Siberian-Husky"}
{"malehw":"Ht: 9-10, Wt: 8-11","femalehw":"Ht: 9-10, Wt: 8-11","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"The silky terrier is no mellow lap dog. She is bold, feisty, inquisitive and playful, ever ready for action, a terrier at heart. She is clever, but tends to be stubborn, and can be mischievous. She tends to bark a lot.","care":"This is an active breed requiring slightly more exercise than most toys. She enjoys a moderate walk on leash, but especially likes the chance to nose around on her own in a safe area. Much of her exercise requirements can be met with vigorous games in the yard, or even house. Despite her hardiness, she is not a breed for outdoor living. Her coat needs brushing or combing every other day.","breed":"Silky Terrier","health":"Major concerns: none\nMinor concerns: intervertebral disc disease, elbow dysplasia, patellar luxation, Legg - Perthes\nOccasionally seen: diabetes, epilepsy, tracheal collapse\nSuggested tests: elbow, knee\nLife span: 11-14 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"•••","affection":"••••","index":134,"url":"https://www.petfinder.com/dog-breeds/Silky-Terrier"}
{"malehw":"Ht: 10, Wt: 18-20","femalehw":"Ht: 9.5, Wt: 18-20","catfriendly":"••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"•••••","care":"The Skye terrier's soft look belies her tough nature. She is a fearless and a deadly rodent hunter. She is also a mild-mannered house pet. She still needs daily exercise in a safe area or on leash, however. She is sensitive yet stubborn. The Skye is affectionate with her family but cautious with strangers. She gets along fairly well with other dogs in the same household. She is extremely courageous and game and makes a good watchdog.","breed":"Skye Terrier","health":"This is a hunting dog at heart and enjoys a daily outing, exploring in a safe area. She also needs a short to moderate walk to stay in shape. The Skye enjoys life as a house dog, and prefers not to live outdoors. Regular combing (about twice a week) is all that is needed to keep the Skye looking good. An occasional bath will not soften the coat too much, as is often the case with other terriers. The hair around the eyes and mouth may need extra cleaning.","energy":"•••","playfulness":"••••","dogfriendly":"••","strangerfriendly":"••","protection":"••","heattolerant":"•••","exercise":"•••","affection":"•••••","index":135,"url":"https://www.petfinder.com/dog-breeds/Skye-Terrier"}
{"malehw":"Ht: <15.5, Wt: 17-19","femalehw":"Ht: <15.5, Wt: 15-17","catfriendly":"•••","easytraining":"•••••","watchdog":"••••••","grooming":"••","coldtolerant":"••••","temperament":"Energetic, inquisitive, bold, feisty, playful, mischievous, independent and adventurous describe the fox terrier. This breed lives to run, chase and explore. He is usually fairly reserved with strangers and tends to bark and dig.","care":"The smooth fox terrier is energetic and cannot be ignored. As an active dog, he will do much to exercise himself given the room. He enjoys a vigorous game or walk, as well as an off-lead outing in a safe area. He does best living in the house and playing in the yard. Smooth coat care consists of weekly brushing to remove shedding hair. In fact, the smooths shed more than the wires.","breed":"Smooth Fox Terrier","health":"Major concerns: none\nMinor concerns: lens luxation, distichiasis, cataract, Legg-Perthes, shoulder dislocation\nOccasionally seen: deafness, patellar luxation\nSuggested tests: eye\nLife span: 10-13 years","energy":"•••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":136,"url":"https://www.petfinder.com/dog-breeds/Smooth-Fox-Terrier"}
{"malehw":"Ht: 18-19, Wt: 35-40","femalehw":"Ht: 17-18, Wt: 30-35","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"•••••","coldtolerant":"••••","care":"The Wheaten makes a playful companion at home and a fun-loving partner in the field. He is affectionate, congenial and much gentler than most terriers. He is generally responsive to his family's wishes but can be headstrong at times. Most are good with children and usually good with other household dogs and pets. He may dig or jump.","breed":"Soft Coated Wheaten Terrier","health":"This is an athletic dog that needs a good daily workout, either in the form of a moderate to long walk or an invigorating game in the yard. He should be allowed loose only in a safe area because he still loves to hunt and chase. The Wheaten is best suited as an indoor dog. His long coat needs brushing or combing every two days. As a nonshedding dog, loose hair becomes entangled in the coat and will mat if not combed out. Bathing and trimming every other month is necessary to maintain the desirable coat and silhouette; pets can be better managed if their coats are clipped to about 3 inches, but then they lose the breed's typical outline.","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"•••","heattolerant":"••","exercise":"••••","affection":"••••••","index":137,"url":"https://www.petfinder.com/dog-breeds/Soft-Coated-Wheaten-Terrier"}
{"malehw":"Ht: 23.5-27.5, Wt: 71-82","femalehw":"Ht: 22.5-25.5, Wt: 62-71","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"•••","coldtolerant":"••••","temperament":"This is a devoted and gentle dog, very willing to please. She is affectionate and gets along well with other dogs and pets and children. She is also courageous. The spinone is calmer and easier going than most pointing breeds.","care":"Like all sporting dogs, the spinone needs daily exercise. This can take the form of a long walk or good run off leash. She is a family dog and prefers to share time with her people. Coat care consists of weekly brushing, plus occasional hand-stripping to neaten the face and feet.","breed":"Spinone Italiano","health":"Major concerns: CHD\nMinor concerns: ectropion, gastric torsion, otitis externa\nOccasionally seen: cerebral ataxis\nSuggested tests: hip, (eye)\nLife span: 12-14 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":138,"url":"https://www.petfinder.com/dog-breeds/Spinone-Italiano"}
{"malehw":"Ht: 18-19, Wt: 35-40","femalehw":"Ht: 17-18, Wt: 30-35","catfriendly":"••••","easytraining":"••••","watchdog":"••••","grooming":"••","coldtolerant":"•••","care":"The Staffordshire bull terrier is a fun-loving character that loves playing with its family and friends. He is typically playful, companionable, amiable, docile and generally responsive to his family's wishes. his love of a good game is rivaled only by his need for human companionship. He is also characteristically friendly toward strangers. Some can be strong-willed. Although he doesn't usually look for a fight, he is fearless and tenacious. He may not do well around strange dogs. He is generally very good with children; although usually gentle, some can be rambunctious. In the United Kingdom the Stafford is known as the Nanny Dog, in reference to its eagerness and ability to assume the role of a child's nursemaid.","breed":"Staffordshire Bull Terrier","health":"This is an athletic breed that needs a good walk on leash every day. He also enjoys a good game in the yard or a run in a safe area. The Stafford is a dog that craves human contact; thus, he is far better suited as a house dog. Coat care is minimal.","energy":"••••","playfulness":"••••••","dogfriendly":"•••","strangerfriendly":"••••","protection":"••••","heattolerant":"•••","exercise":"••••","affection":"•••••","index":139,"url":"https://www.petfinder.com/dog-breeds/Staffordshire-Bull-Terrier"}
{"malehw":"Ht: 18.5-19.5, Wt: 40-45","femalehw":"Ht: 17.5-18.5, Wt: 35-40","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"•••••","coldtolerant":"••••","temperament":"Bold and lively, the standard schnauzer is a fun-loving companion and guardian. He is clever and headstrong, and unless given daily physical and mental exercise, he can be mischievous. He does best with a firm, patient parent. He is a devoted family dog and very reliable with children. He is good with other family pets. He can be reserved with strangers, sometimes acting suspicious and protective.","care":"The standard schnauzer needs daily exertion, either a long walk on leash, a vigorous game or an off-lead outing in a safe area. He is better off dividing his time between house and yard. His harsh coat needs combing twice weekly, plus professional scissoring and shaping four times yearly. Shaping is done by clipping or stripping.","breed":"Standard Schnauzer","health":"Major concerns: none\nMinor concerns: CHD, follicular dermatitis\nOccasionally seen: none\nSuggested tests: hip\nLife span: 12-14 years","energy":"•••••","playfulness":"••••","dogfriendly":"•••","strangerfriendly":"••","protection":"••••••","heattolerant":"••••","exercise":"••••","affection":"•••","index":140,"url":"https://www.petfinder.com/dog-breeds/Standard-Schnauzer"}
{"malehw":"Ht: 13-15, Wt: 35-45","femalehw":"Ht: 13-15, Wt: 35-45","catfriendly":"•••••","easytraining":"•••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"The Sussex spaniel tends to be less playful and demonstrative than other spaniels, with a lower energy level. This makes her better suited for city life, but she still appreciates the chance to take to the wilds and hunt up birds. She tends to bark when hunting, which has made her less popular with hunters than other breeds; some also bark or howl when not hunting. At home she is calm, steady and easygoing. Her somber expression is misleading because she is quite cheerful.","care":"The Sussex needs daily exercise, but her needs can be met with a good walk on lead or a short romp in the yard. Given the chance, she will appreciate a longer foray into the field. She generally does best as a house dog that also has access to a yard. The coat needs brushing and combing two to three times a week, plus scissoring every few months.","breed":"Sussex Spaniel","health":"Major concerns: none\nMinor concerns: intervertebral disc syndrome, otitis exerna, heart murmur and enlarged heart\nOccasionally seen: none\nSuggested tests: cardiac\nLife span: 12-14 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":141,"url":"https://www.petfinder.com/dog-breeds/Sussex-Spaniel"}
{"malehw":"Ht: 10, Wt: 9-15","femalehw":"Ht: 10, Wt: 9-15","catfriendly":"•••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"The Tibetan Spaniel is independent, bold, and stubborn, but is also sensitive and biddable. He has a happy attitude, enjoying games and outings with his family. He also enjoys snoozes next to his special person. He is an exceptionally enjoyable and fastidious house dog. He is amiable with other dogs and animals, but reserved with strangers.","care":"The Tibbie's exercise needs are minimal, but daily. His needs can be met by games inside the house or yard, or with a short walk on leash. This breed is suited for apartment life and should not live outside. His coat needs brushing and combing twice weekly.","breed":"Tibetan Spaniel","health":"Major concerns: none\nMinor concerns: patellar luxation\nOccasionally seen: PRA\nSuggested tests: knee, eye\nLife span: 12-15 years","energy":"••••","playfulness":"••••","dogfriendly":"•••••","strangerfriendly":"••","protection":"••","heattolerant":"•••","exercise":"•••","affection":"••••","index":142,"url":"https://www.petfinder.com/dog-breeds/Tibetan-Spaniel"}
{"malehw":"Ht: 15-16, Wt: 20-24","femalehw":"Ht: 15-16, Wt: 20-24","catfriendly":"••••","easytraining":"••••","watchdog":"•••••","grooming":"•••••","coldtolerant":"••••","temperament":"Gentle and amiable, the Tibetan Terrier makes a charming, dependable companion both indoors and out. He is equally up for an adventure in the field, a game in the yard or a snooze in the house. He is sensitive, very companionable and willing to please.","care":"The Tibetan Terrier likes to run and explore, and needs daily exercise in a safe area. His needs can also be met by a vigorous game in the yard or a moderately long walk on leash. He is best as an indoor, or indoor/outdoor, dog. His long coat needs thorough brushing or combing once or twice a week.","breed":"Tibetan Terrier","health":"Major concerns: lens luxation, PRA, ceroid lipofuscinosis\nMinor concerns: patellar luxation, cataract, CHD\nOccasionally seen: distichiasis\nSuggested tests: eye, hip\nLife span: 12-15 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":143,"url":"https://www.petfinder.com/dog-breeds/Tibetan-Terrier"}
{"malehw":"Ht: 22-24, Wt: 45-65","femalehw":"Ht: 21-23, Wt: 45-65","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••","coldtolerant":"•••","care":"Bred to be a close-working gun dog, the vizsla has the energy to range all day. He is a true hunter at heart, a talented pointer and always on the lookout for bird scent. He can become frustrated and destructive if not given adequate exercise. Most can be stubborn, some can be timid and others can be overly excitable. He is gentle, affectionate and sensitive, and can be protective. The vizsla makes a good companion for an active family who spends a lot of time outdoors.","breed":"Vizsla","health":"The vizsla needs a lot of strenuous exercise every day. This is an active breed that cannot be expected to meet his energy requirements with a short walk or within a small yard. He needs to be jogged or allowed to run in a large enclosed area. Otherwise, his needs are minimal. His coat requires little care except an occasional brushing to remove dead hair. He needs a soft bed.","energy":"••••","playfulness":"•••••","dogfriendly":"••••","strangerfriendly":"••••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":144,"url":"https://www.petfinder.com/dog-breeds/Vizsla"}
{"malehw":"Ht: 25-27, Wt: 70-85","femalehw":"Ht: 23-25, Wt: 70-85","catfriendly":"•••","easytraining":"•••","watchdog":"••••••","grooming":"••","coldtolerant":"•••","care":"The Weimaraner is bold and rambunctious. He loves to run and hunt and can become frustrated and destructive if kept penned up. He can be stubborn or headstrong. he functions best with an active family who enjoys outdoor activities and wants a fun-loving companion.","breed":"Weimaraner","health":"Daily strenuous exertion is a must for the Weimaraner. He needs to stretch his legs, run and explore in a large, safe area. As a social dog, he does best when he can divide his time between indoors and out. Coat care is minimal: occasional brushing to remove dead hair.","energy":"••••••","playfulness":"•••••","dogfriendly":"•••","strangerfriendly":"•••","protection":"•••••","heattolerant":"••••","exercise":"••••••","affection":"••••","index":145,"url":"https://www.petfinder.com/dog-breeds/Weimaraner"}
{"malehw":"Ht: 18-19, Wt: 35-45","femalehw":"Ht: 17-18, Wt: 35-45","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••••","coldtolerant":"••••","temperament":"Less exuberant that the English springer, the Welsh springer spaniel is steady and easygoing. She still needs plenty of hard exercise, however, as she loves to hunt for birds. She is extremely devoted to her family, but she is independent in nature.","care":"The Welsh needs daily exercise, which can be met with long walks on leash combined with strenuous games in the yard. She especially likes jaunts afield and makes a good hiking companion. She does best living inside with her family. The coat needs brushing once or twice weekly and also needs occasional scissoring to neaten stragglers.","breed":"Welsh Springer Spaniel","health":"Major concerns: CHD\nMinor concerns: glaucoma, otitis externa, epilepsy\nOccasionally seen: cataract\nSuggested tests: hip, (eye)\nLife span: 12-15 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••","protection":"•••","heattolerant":"••••","exercise":"••••","affection":"••••","index":146,"url":"https://www.petfinder.com/dog-breeds/Welsh-Springer-Spaniel"}
{"malehw":"Ht: 18-19, Wt: 35-40","femalehw":"Ht: 17-18, Wt: 30-35","catfriendly":"••","easytraining":"••","watchdog":"••••••","grooming":"•••••","coldtolerant":"••••","temperament":"The Welsh, although more mild-mannered than many terriers, is still playful and mischievous enough to provide plenty of entertainment and challenges, yet he is calm enough to be a reliable house pet. He is independent, inquisitive and sensitive. He needs daily exercise in a safe area. He may dig and bark.","care":"The Welsh terrier needs a moderate walk on leash every day or an invigorating play session. If allowed to run off leash, he should be in a safe area because he tends to hunt. The Welsh does best when allowed access to house and yard. His wiry jacket needs combing two to three times weekly, plus shaping every three months. Shaping for pets is by clipping or stripping.","breed":"Welsh Terrier","health":"Major concerns: none\nMinor concerns: lens luxation\nOccasionally seen: cataracts, patellar luxation, distichiasis\nSuggested tests: eye, (knee)\nLife span: 12-14 years","energy":"••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••","index":147,"url":"https://www.petfinder.com/dog-breeds/Welsh-Terrier"}
{"malehw":"Ht: 11, Wt: 15-21","femalehw":"Ht: 10, Wt: 15-21","catfriendly":"••••","easytraining":"•••••","watchdog":"•••••","grooming":"•••••","coldtolerant":"••••","care":"The busy Westie is happy, curious and always in the thick of things. She is affectionate and demanding, one of the friendliest terriers. She is not friendly, however, toward small animals. She enjoys a daily romp in a safe area or a walk on lead, as well as playtime at home. She is independent and somewhat stubborn and may bark and dig.","breed":"West Highland White Terrier","health":"The Westie needs either a short to moderate walk on leash or a good game in the yard every day. Her wire coat needs combing two or three times weekly, plus shaping every three months. Shaping for pets is by clipping or stripping. In some areas, it may be difficult to keep her coat white.","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"••••••","index":148,"url":"https://www.petfinder.com/dog-breeds/West-Highland-White-Terrier"}
{"malehw":"Ht: 19-22, Wt: 20-40","femalehw":"Ht: 18-21, Wt: 20-40","catfriendly":"•••••","easytraining":"••••","watchdog":"•••••","grooming":"••","coldtolerant":"••","care":"Perhaps the most demonstrative and obedient of the true sighthounds, the Whippet makes an ideal pet for people who want a quiet house dog and absolutely devoted companion. The Whippet is extremely gentle with children and can make an excellent companion for them. He is calm indoors but loves to run and play outdoors. The whippet is extremely sensitive (both physically and mentally) and cannot take rough treatment or harsh corrections.","breed":"Whippet","health":"The Whippet can make a good apartment dog if taken for a long walk or run daily. Grooming is minimal. The Whippet must have a warm, soft bed. He dislikes cold weather intensely and cannot be expected to live outside. The Whippet can play and run in snow and cold weather but should spend inactive times in warmer temperatures. The hair is extremely short and fine, and the whippet is virtually free of \"doggy odor.\"","energy":"••••","playfulness":"••••","dogfriendly":"••••••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":149,"url":"https://www.petfinder.com/dog-breeds/Whippet"}
{"malehw":"Ht: <15.5, Wt: 17-19","femalehw":"Ht: <15.5, Wt: 15-17","catfriendly":"•••","easytraining":"•••••","watchdog":"••••••","grooming":"•••••","coldtolerant":"••••","care":"A true \"live-wire,\" the wire fox terrier is always up for adventure. This breed lives to play, explore, run, hunt and chase. He can be mischievous and independent and may dig and bark. He is usually fairly reserved with strangers.","breed":"Wire Fox Terrier","health":"The fox terrier must have daily exercise. He will do much to exercise himself given the room, but he profits from a good walk on leash, a vigorous play session or an off-lead outing in a safe area. He does better as an indoor dog with access to a secure yard. The wire's coat needs combing two or three times weekly, plus shaping every three months. Shaping for pets is by clipping or stripping.","energy":"•••••","playfulness":"•••••","dogfriendly":"••","strangerfriendly":"•••••","protection":"••","heattolerant":"••••","exercise":"••••","affection":"•••••","index":150,"url":"https://www.petfinder.com/dog-breeds/Wire-Fox-Terrier"}
{"malehw":"Ht: 22-24, Wt: 50-60","femalehw":"Ht: 20-22, Wt: 50-60","catfriendly":"••••","easytraining":"••••","watchdog":"••••••","grooming":"••••","coldtolerant":"••••","temperament":"The wirehaired pointing griffon is a skilled field dog, pointing and retrieving with a deliberate style, generally staying within the hunter's gun range. He combines independent action with the ability to be directed by the hunter. He is an equally adept family pet, absolutely devoted, willing to please, amiable and often comical. He is generally friendly toward strangers, other dogs and pets.","care":"The wirehaired pointing griffon needs daily exertion, either in the form of jogging, games or a run in the field. He particularly enjoys swimming. He does best when allowed to be both an indoor and outdoor dog. His harsh coat needs combing or brushing once or twice a week, plus hand-stripping to remove dead hair twice a year. His ears need regular cleaning and plucking of hair within the canal in order to avoid ear problems.","breed":"Wirehaired Pointing Griffon","health":"Major concerns: none\nMinor concerns: CHD, otitis externa, entropion, ectropion\nOccasionally seen: none\nSuggested tests: (hip), (eye)\nLife span: 12-14 years","energy":"•••••","playfulness":"••••","dogfriendly":"••••","strangerfriendly":"••••","protection":"••••","heattolerant":"•••","exercise":"•••••","affection":"••••","index":151,"url":"https://www.petfinder.com/dog-breeds/Wirehaired-Pointing-Griffon"}
{"malehw":"Ht: 8-9, Wt: <7","femalehw":"Ht: 8-9, Wt: <7","catfriendly":"•••","easytraining":"•••","watchdog":"••••••","grooming":"•••••","coldtolerant":"•••","care":"The Yorkshire Terrier seems oblivious of her small size, ever eager for adventure and trouble. She is busy, inquisitive, bold, stubborn. Although some tend to bark a lot, she can easily be taught not to do so.","breed":"Yorkshire Terrier","health":"Yorkies tend to exercise themselves within the home, but they also need to have interaction in the form of games. They appreciate a short walk outdoors on leash and enjoy the chance to explore a safe area. This is definitely not a dog that can live outdoors. The long coat needs brushing or combing every day or two.","energy":"•••••","playfulness":"•••••","dogfriendly":"•••","strangerfriendly":"••••","protection":"••","heattolerant":"••••","exercise":"••","affection":"••••","index":152,"url":"https://www.petfinder.com/dog-breeds/Yorkshire-Terrier"}
]